#+title: NFDI4BI-KG
#+author: All contributors
#+date: [2025-03-24 Mon] 
#+property: header-args :noweb yes
* NFDI4BI-KG: The NFDI4BIOIMAGE Knowledge Graph
:PROPERTIES:
:ID:       fc647655-1e49-41e7-96f2-6e7ce03c577d
:END:


* Graphs and queries
:PROPERTIES:
:ID:       f275722e-acb8-48c0-9875-ca191e1fb562
:header-args:sparql: :url http://kg.nfdi4bioimage.de/N4BIKG/sparql
:END:
Since June 16 2025, the NFDI4BIOIMAGE Knowledge Graph is operational at http://kg.nfdi4bioimage.de. 
#+begin_src sparql :noweb-ref prefixes
  PREFIX owl: <http://www.w3.org/2002/07/owl#>
  PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#>
  PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#>
  prefix dcite: <https://schema.datacite.org/meta/kernel-4.6/metadata.xsd#>
  prefix nfdicore: <https://nfdi.fiz-karlsruhe.de/ontology/>
  prefix zenodocomm: <https://zenodo.org/communities/>
  prefix sio: <http://semanticscience.org/resource/>
#+end_src

** Graphs
:PROPERTIES:
:ID:       0e01ef08-fb7c-4336-971f-de43a7763409
:END:
*** Default graph
:PROPERTIES:
:ID:       bcd055b3-f942-4f05-8652-2583307ef7c6
:END:
The default graph is the union of all named graphs.
*** Named graphs
:PROPERTIES:
:ID:       3bbe4960-5160-46ef-a6f2-93d63bfdfa7a
:END:
#+begin_src sparql

SELECT ?graph (count(?subject) as ?number_of_triples)
WHERE {
  graph ?graph {  ?subject ?predicate ?object }
}
group by ?graph
#+end_src

#+RESULTS:
| graph                                                    | number_of_triples |
|----------------------------------------------------------+-------------------|
| https://kg.nfdi4bioimage.de/n4bikg/core                  |                16 |
| https://kg.nfdi4bioimage.de/n4bikg/n4bi_zenodo_community |              5349 |
| https://kg.nfdi4bioimage.de/n4bikg/services              |                 9 |
| https://kg.nfdi4bioimage.de/n4bikg/owl                   |             13774 |

** Example queries
:PROPERTIES:
:ID:       88e593e5-defe-4211-ab3d-c407739d75f7
:END:

*** spo
:PROPERTIES:
:ID:       bd5e3d52-41fe-4676-b6bf-78a0be8a0a55
:END:
#+begin_src sparql
  PREFIX owl: <http://www.w3.org/2002/07/owl#>
  PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#>
  PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#>
  prefix dcite: <https://schema.datacite.org/meta/kernel-4.6/metadata.xsd#>
  select ?s ?p ?plabel ?o ?olabel where 
  {
    ?s ?p ?o
    optional {
      ?p rdfs:label ?plabel.
    }
    optional {
      ?o rdfs:label ?olabel .
    }
  }
  limit 10
#+end_src

#+RESULTS:
| s                                                   | p                                                   | plabel                  | o                                                                          | olabel          |
|-----------------------------------------------------+-----------------------------------------------------+-------------------------+----------------------------------------------------------------------------+-----------------|
| https://nfdi4bioimage.de/rdf/node                   | http://www.w3.org/1999/02/22-rdf-syntax-ns#type     |                         | https://nfdi.fiz-karlsruhe.de/ontology/NFDI_0001039                        | nfdi consortium |
| https://nfdi4bioimage.de/rdf/node                   | http://purl.org/dc/elements/1.1/description         |                         | Nationale Forschungsdateninfrastruktur für Mikroskopie und Bildanalyse     |                 |
| https://nfdi4bioimage.de/rdf/node                   | http://purl.org/dc/elements/1.1/description         |                         | National Research Data Infrastructure for Microscopy and Bioimage Analysis |                 |
| https://nfdi4bioimage.de/rdf/node                   | https://nfdi.fiz-karlsruhe.de/ontology/NFDI_0000136 | foundation date         | 2023-03-01                                                                 |                 |
| https://nfdi4bioimage.de/rdf/node                   | https://nfdi.fiz-karlsruhe.de/ontology/NFDI_0001006 | has external identifier | https://wikidata.org/entity/Q113500855                                     |                 |
| https://nfdi4bioimage.de/rdf/node                   | https://nfdi.fiz-karlsruhe.de/ontology/NFDI_0001008 | has url                 | https://nfdi4bioimage.de                                                   |                 |
| https://nfdi4bioimage.de/rdf/node                   | https://nfdi.fiz-karlsruhe.de/ontology/NFDI_0010015 | has acronym             | N4BI                                                                       |                 |
| https://nfdi4bioimage.de/rdf/node                   | https://nfdi.fiz-karlsruhe.de/ontology/NFDI_0010015 | has acronym             | NFDI4BIOIMAGE                                                              |                 |
| https://nfdi4bioimage.de/rdf/node                   | https://nfdi.fiz-karlsruhe.de/ontology/NFDI_0000195 | represents collection   | https://zenodo.org/communities/nfdi4bioimage                               |                 |
| https://nfdi.fiz-karlsruhe.de/ontology/NFDI_0001039 | http://www.w3.org/1999/02/22-rdf-syntax-ns#type     |                         | http://www.w3.org/2002/07/owl#Class                                        |                 |

*** Creators and contributors for a record
:PROPERTIES:
:ID:       bd5e3d52-41fe-4676-b6bf-78a0be8a0a55
:END:
#+begin_src sparql 
  PREFIX owl: <http://www.w3.org/2002/07/owl#>
  PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#>
  PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#>
  prefix dcite: <https://schema.datacite.org/meta/kernel-4.6/metadata.xsd#>
  prefix nfdicore: <https://nfdi.fiz-karlsruhe.de/ontology/>
  select *
  where
  {
    <https://doi.org/10.5281/zenodo.14013026> dcite:creator ?creator .
    ?creator dcite:givenName ?creator_given_name ;
             dcite:familyName ?creator_family_name .
    ?creator dcite:affiliation ?affiliation .
    filter(isiri(?affiliation))
    ?affiliation rdfs:label ?affiliation_name .
  }
  limit 40
#+end_src

#+RESULTS:
| creator                               | creator_given_name | creator_family_name       | affiliation               | affiliation_name                           |
|---------------------------------------+--------------------+---------------------------+---------------------------+--------------------------------------------|
| https://orcid.org/0000-0001-9568-895X | Christian          | Schmidt                   | https://ror.org/0546hnb39 | University of Konstanz                     |
| https://orcid.org/0000-0001-9568-895X | Christian          | Schmidt                   | https://ror.org/04cdgtt98 | German Cancer Research Center              |
| https://orcid.org/0000-0001-9568-895X | Christian          | Christian Schmidt         | https://ror.org/0546hnb39 | University of Konstanz                     |
| https://orcid.org/0000-0001-9568-895X | Christian          | Christian Schmidt         | https://ror.org/04cdgtt98 | German Cancer Research Center              |
| https://orcid.org/0000-0001-7734-3771 | Stefanie           | Stefanie Weidtkamp-Peters | https://ror.org/01vnkaz16 | NFDI4BIOIMAGE                              |
| https://orcid.org/0000-0001-7734-3771 | Stefanie           | Stefanie Weidtkamp-Peters | https://ror.org/024z2rq82 | Heinrich Heine University Düsseldorf       |
| https://orcid.org/0000-0001-7734-3771 | Stefanie           | Weidtkamp-Peters          | https://ror.org/01vnkaz16 | NFDI4BIOIMAGE                              |
| https://orcid.org/0000-0001-7734-3771 | Stefanie           | Weidtkamp-Peters          | https://ror.org/024z2rq82 | Heinrich Heine University Düsseldorf       |
| https://orcid.org/0000-0001-6523-7496 | Susanne            | Kunis                     | https://ror.org/04qmmjx98 | Osnabrück University                       |
| b0                                    | Tom                | Boissonnet                | https://ror.org/024z2rq82 | Heinrich Heine University Düsseldorf       |
| b1                                    | Bettina            | Hagen                     | https://ror.org/04xx1tc24 | Max Planck Institute for Biology of Ageing |

Some records must have the full name set as 'family name'.

*** ORCID properties
:PROPERTIES:
:ID:       7329c725-8e84-49eb-ad67-d3c7a238c970
:END:
#+begin_src sparql 
  PREFIX owl: <http://www.w3.org/2002/07/owl#>
  PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#>
  PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#>
  prefix dcite: <https://schema.datacite.org/meta/kernel-4.6/metadata.xsd#>
  prefix nfdicore: <https://nfdi.fiz-karlsruhe.de/ontology/>
  select *
  where
  {
    <https://orcid.org/0000-0001-7734-3771> dcite:givenName ?first;
                                            dcite:familyName ?last .
  }
 #+end_src

 #+RESULTS:
 | first    | last                      |
 |----------+---------------------------|
 | Stefanie | Stefanie Weidtkamp-Peters |
 | Stefanie | Weidtkamp-Peters          |

 
 
*** Number of records in zenodo community
:PROPERTIES:
:ID:       82d5b3dd-9372-4864-a99b-fb2dbcce8717
:END:
#+begin_src sparql :noweb yes
  <<prefixes>>
  select (count(?record) as ?records) where {
    graph <https://kg.nfdi4bioimage.de/n4bikg/n4bi_zenodo_community> { <https://zenodo.org/communities/nfdi4bioimage> <http://semanticscience.org/resource/SIO_000088> ?record} 
    }
  limit 10
#+end_src

#+RESULTS:
| records |
|---------|
|     261 |

*** Number of records total
:PROPERTIES:
:ID:       da0de7b7-1be1-4e71-bea5-88620343e850
:END:

#+begin_src sparql :session sparql
  PREFIX owl: <http://www.w3.org/2002/07/owl#>
  PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#>
  PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#>
  prefix dcite: <https://schema.datacite.org/meta/kernel-4.6/metadata.xsd#>
  prefix nfdicore: <https://nfdi.fiz-karlsruhe.de/ontology/>
  prefix zenodocomm: <https://zenodo.org/communities/>
  prefix sio: <http://semanticscience.org/resource/>

  select distinct ?record where
  {
    ?record dcite:creator ?creator .
  }
#+end_src

#+RESULTS:
| record                                     |
|--------------------------------------------|
| https://doi.org/10.5281/zenodo.11261115    |
| https://doi.org/10.5281/zenodo.14626054    |
| https://doi.org/10.5281/zenodo.14623257    |
| https://doi.org/10.5281/zenodo.14620253    |
| https://doi.org/10.5281/zenodo.14418209    |
| https://doi.org/10.5281/zenodo.14412107    |
| https://doi.org/10.5281/zenodo.14278058    |
| https://doi.org/10.5281/zenodo.13640979    |
| https://doi.org/10.5281/zenodo.13628852    |
| https://doi.org/10.5281/zenodo.13506641    |
| https://doi.org/10.5281/zenodo.13168693    |
| https://doi.org/10.5281/zenodo.12623730    |
| https://doi.org/10.5281/zenodo.12521485    |
| https://doi.org/10.5281/zenodo.12087272    |
| https://doi.org/10.5281/zenodo.12077569    |
| https://doi.org/10.5281/zenodo.11574994    |
| https://doi.org/10.5281/zenodo.11574435    |
| https://doi.org/10.5281/zenodo.11525313    |
| https://doi.org/10.5281/zenodo.11448638    |
| https://doi.org/10.5281/zenodo.11412513    |
| https://doi.org/10.5281/zenodo.11369042    |
| https://doi.org/10.5281/zenodo.11344132    |
| https://doi.org/10.5281/zenodo.11312181    |
| https://doi.org/10.5281/zenodo.11259495    |
| https://doi.org/10.5281/zenodo.11235081    |
| https://doi.org/10.5281/zenodo.11220181    |
| https://doi.org/10.5281/zenodo.11191762    |
| https://doi.org/10.5281/zenodo.11126631    |
| https://doi.org/10.5281/zenodo.11122233    |
| https://doi.org/10.5281/zenodo.11080237    |
| https://doi.org/10.5281/zenodo.10978831    |
| https://doi.org/10.5281/zenodo.10968458    |
| https://doi.org/10.5281/zenodo.10947701    |
| https://doi.org/10.5281/zenodo.10935236    |
| https://doi.org/10.5281/zenodo.10907116    |
| https://doi.org/10.5281/zenodo.17186869    |
| https://doi.org/10.5281/zenodo.17174207    |
| https://doi.org/10.5281/zenodo.17085991    |
| https://doi.org/10.5281/zenodo.16812312    |
| https://doi.org/10.5281/zenodo.16793739    |
| https://doi.org/10.5281/zenodo.15858127    |
| https://doi.org/10.5281/zenodo.15793536    |
| https://doi.org/10.5281/zenodo.15751975    |
| https://doi.org/10.5281/zenodo.15750255    |
| https://doi.org/10.5281/zenodo.15735577    |
| https://doi.org/10.5281/zenodo.15698366    |
| https://doi.org/10.5281/zenodo.15606013    |
| https://doi.org/10.5281/zenodo.15546497    |
| https://doi.org/10.5281/zenodo.15481680    |
| https://doi.org/10.5281/zenodo.15469809    |
| https://doi.org/10.5281/zenodo.15424704    |
| https://doi.org/10.5281/zenodo.15379632    |
| https://doi.org/10.5281/zenodo.15367563    |
| https://doi.org/10.5281/zenodo.15319829    |
| https://doi.org/10.5281/zenodo.15279551    |
| https://doi.org/10.5281/zenodo.15267559    |
| https://doi.org/10.5281/zenodo.15223802    |
| https://doi.org/10.5281/zenodo.15193418    |
| https://doi.org/10.5281/zenodo.15182563    |
| https://doi.org/10.5281/zenodo.15165424    |
| https://doi.org/10.5281/zenodo.14848838    |
| https://doi.org/10.5281/zenodo.14001044    |
| https://doi.org/10.5281/zenodo.10816895    |
| https://doi.org/10.5281/zenodo.15268798    |
| https://doi.org/10.5281/zenodo.8340248     |
| https://doi.org/10.5281/zenodo.8019760     |
| https://doi.org/10.5281/zenodo.7928333     |
| https://doi.org/10.5281/zenodo.7082609     |
| https://doi.org/10.5281/zenodo.7082514     |
| https://doi.org/10.5281/zenodo.6560026     |
| https://doi.org/10.5281/zenodo.6504714     |
| https://doi.org/10.5281/zenodo.6504467     |
| https://doi.org/10.5281/zenodo.6504208     |
| https://doi.org/10.5281/zenodo.6501614     |
| https://doi.org/10.5281/zenodo.15423904    |
| https://doi.org/10.5281/zenodo.15083018    |
| https://doi.org/10.5281/zenodo.15031842    |
| https://doi.org/10.5281/zenodo.14999220    |
| https://doi.org/10.5281/zenodo.14845059    |
| https://doi.org/10.5281/zenodo.14716546    |
| https://doi.org/10.5281/zenodo.14650434    |
| https://doi.org/10.5281/zenodo.14234608    |
| https://doi.org/10.5281/zenodo.14001388    |
| https://doi.org/10.5281/zenodo.13991322    |
| https://doi.org/10.5281/zenodo.13970736    |
| https://doi.org/10.5281/zenodo.13831274    |
| https://doi.org/10.5281/zenodo.13747937    |
| https://doi.org/10.5281/zenodo.13380289    |
| https://doi.org/10.5281/zenodo.11503289    |
| https://doi.org/10.5281/zenodo.11235513    |
| https://doi.org/10.5281/zenodo.10687659    |
| https://doi.org/10.5281/zenodo.10617006    |
| https://doi.org/10.5281/zenodo.10609771    |
| https://doi.org/10.5281/zenodo.10008465    |
| https://doi.org/10.5281/zenodo.17087096    |
| https://doi.org/10.5281/zenodo.16911980    |
| https://doi.org/10.5281/zenodo.15756866    |
| https://doi.org/10.5281/zenodo.15597856    |
| https://doi.org/10.5281/zenodo.15575379    |
| https://doi.org/10.5281/zenodo.15479606    |
| https://doi.org/10.5281/zenodo.15393592    |
| https://doi.org/10.5281/zenodo.7890311     |
| https://doi.org/10.5281/zenodo.15026373    |
| https://doi.org/10.5281/zenodo.14832855    |
| https://doi.org/10.5281/zenodo.14178789    |
| https://doi.org/10.5281/zenodo.14013026    |
| https://doi.org/10.5281/zenodo.13861026    |
| https://doi.org/10.5281/zenodo.11501662    |
| https://doi.org/10.5281/zenodo.11350689    |
| https://doi.org/10.5281/zenodo.11109616    |
| https://doi.org/10.5281/zenodo.10939520    |
| https://doi.org/10.5281/zenodo.15796252    |
| https://doi.org/10.5281/zenodo.8070038     |
| https://doi.org/10.5281/zenodo.5101158     |
| https://doi.org/10.5281/zenodo.15065070    |
| https://doi.org/10.5281/zenodo.14988921    |
| https://doi.org/10.5281/zenodo.17251110    |
| https://doi.org/10.5281/zenodo.8349563     |
| https://doi.org/10.5281/zenodo.15308773    |
| https://doi.org/10.5281/zenodo.15225616    |
| https://doi.org/10.5281/zenodo.15033241    |
| https://doi.org/10.5281/zenodo.14997835    |
| https://doi.org/10.5281/zenodo.14954254    |
| https://doi.org/10.5281/zenodo.14953098    |
| https://doi.org/10.5281/zenodo.14950686    |
| https://doi.org/10.5281/zenodo.13837146    |
| https://doi.org/10.5281/zenodo.16992303    |
| https://doi.org/10.5281/zenodo.14998017    |
| https://doi.org/10.5281/zenodo.14951142    |
| https://doi.org/10.5281/zenodo.8434325     |
| https://doi.org/10.5281/zenodo.8414319     |
| https://doi.org/10.5281/zenodo.15047849    |
| https://doi.org/10.5281/zenodo.14979253    |
| https://doi.org/10.5281/zenodo.14975462    |
| https://doi.org/10.5281/zenodo.14909526    |
| https://doi.org/10.5281/zenodo.14044640    |
| https://doi.org/10.5281/zenodo.14044380    |
| https://doi.org/10.5281/zenodo.11548617    |
| https://doi.org/10.5281/zenodo.10793700    |
| https://doi.org/10.5281/zenodo.10730424    |
| https://doi.org/10.5281/zenodo.17093454    |
| https://doi.org/10.5281/zenodo.16880913    |
| https://doi.org/10.5281/zenodo.16735994    |
| https://doi.org/10.5281/zenodo.15152576    |
| https://doi.org/10.5281/zenodo.16979744    |
| https://doi.org/10.5281/zenodo.15771899    |
| https://doi.org/10.5281/zenodo.7656540     |
| https://doi.org/10.5281/zenodo.14006558    |
| https://doi.org/10.5281/zenodo.13684187    |
| https://doi.org/10.5281/zenodo.10886750    |
| https://doi.org/10.5281/zenodo.10083555    |
| https://doi.org/10.1038/s41598-019-56067-w |
| https://doi.org/10.5281/zenodo.17014253    |
| https://doi.org/10.5281/zenodo.8329306     |
| https://doi.org/10.5281/zenodo.14014252    |
| https://doi.org/10.5281/zenodo.14792534    |
| https://doi.org/10.5281/zenodo.11031747    |
| https://doi.org/10.5281/zenodo.10808486    |
| https://doi.org/10.5281/zenodo.17404133    |
| https://doi.org/10.5281/zenodo.17372593    |
| https://doi.org/10.5281/zenodo.17191504    |
| https://doi.org/10.5281/zenodo.11502721    |
| https://doi.org/10.5281/zenodo.16993178    |
| https://doi.org/10.5281/zenodo.16736220    |
| https://doi.org/10.5281/zenodo.17103962    |
| https://doi.org/10.5281/zenodo.16735885    |
| https://doi.org/10.5281/zenodo.8139354     |
| https://doi.org/10.5281/zenodo.17296688    |
| https://doi.org/10.5281/zenodo.14035822    |
| https://doi.org/10.5281/zenodo.15373555    |
| https://doi.org/10.5281/zenodo.14381522    |
| https://doi.org/10.5281/zenodo.17092348    |
| https://doi.org/10.5281/zenodo.16736342    |
| https://doi.org/10.5281/zenodo.16561545    |
| https://doi.org/10.5281/zenodo.16561338    |
| https://doi.org/10.5281/zenodo.16412004    |
| https://doi.org/10.5281/zenodo.12699637    |
| https://doi.org/10.5281/zenodo.14937632    |
| https://doi.org/10.5281/zenodo.17098115    |
| https://doi.org/10.5281/zenodo.17092303    |
| https://doi.org/10.5281/zenodo.16735893    |
| https://doi.org/10.5281/zenodo.16992904    |
| https://doi.org/10.5281/zenodo.16993059    |
| https://doi.org/10.5281/zenodo.16980217    |
| https://doi.org/10.5281/zenodo.16992716    |
| https://doi.org/10.5281/zenodo.16993297    |
| https://doi.org/10.5281/zenodo.16991961    |
| https://doi.org/10.5281/zenodo.16980661    |
| https://doi.org/10.5281/zenodo.16993955    |
| https://doi.org/10.5281/zenodo.14186101    |
| https://doi.org/10.5281/zenodo.10389955    |
| https://doi.org/10.5281/zenodo.11146807    |
| https://doi.org/10.5281/zenodo.16980386    |
| https://doi.org/10.5281/zenodo.16993649    |
| https://doi.org/10.5281/zenodo.7015307     |
| https://doi.org/10.5281/zenodo.7394675     |


*** Count number of creators and contributors per record.
:PROPERTIES:
:ID:       bd5e3d52-41fe-4676-b6bf-78a0be8a0a55
:END:
#+begin_src sparql :session sparql
  PREFIX owl: <http://www.w3.org/2002/07/owl#>
  PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#>
  PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#>
  prefix dcite: <https://schema.datacite.org/meta/kernel-4.6/metadata.xsd#>
  prefix nfdicore: <https://nfdi.fiz-karlsruhe.de/ontology/>
  select ?record (count(distinct ?creator) as ?ncreators) (count(distinct ?contributor) as ?ncontributor)
  where
  {
    ?record dcite:contributor ?contributor ;
            dcite:creator ?creator .
  }
  group by ?record
#+end_src

#+RESULTS:
| record                                     | ncreators | ncontributor |
|--------------------------------------------+-----------+--------------|
| https://doi.org/10.5281/zenodo.14937632    |         1 |            1 |
| https://doi.org/10.5281/zenodo.11031747    |         1 |            1 |
| https://doi.org/10.1038/s41598-019-56067-w |         1 |            1 |
| https://doi.org/10.5281/zenodo.16980217    |         2 |            1 |
| https://doi.org/10.5281/zenodo.14951142    |         1 |            3 |
| https://doi.org/10.5281/zenodo.16992904    |         4 |            1 |
| https://doi.org/10.5281/zenodo.11350689    |         3 |            2 |
| https://doi.org/10.5281/zenodo.17098115    |         1 |            1 |
| https://doi.org/10.5281/zenodo.14044380    |         9 |            1 |
| https://doi.org/10.5281/zenodo.16993955    |         2 |            1 |
| https://doi.org/10.5281/zenodo.15373555    |         3 |            1 |
| https://doi.org/10.5281/zenodo.14186101    |         1 |            5 |
| https://doi.org/10.5281/zenodo.16993059    |         2 |            1 |
| https://doi.org/10.5281/zenodo.16993178    |         5 |            1 |
| https://doi.org/10.5281/zenodo.16979744    |        12 |            1 |
| https://doi.org/10.5281/zenodo.16993297    |         1 |            1 |
| https://doi.org/10.5281/zenodo.16735994    |         8 |            2 |
| https://doi.org/10.5281/zenodo.16736220    |         7 |            2 |
| https://doi.org/10.5281/zenodo.11502721    |         1 |            9 |
| https://doi.org/10.5281/zenodo.5101158     |         1 |            1 |
| https://doi.org/10.5281/zenodo.16736342    |         5 |            2 |
| https://doi.org/10.5281/zenodo.16735893    |         4 |            2 |
| https://doi.org/10.5281/zenodo.14178789    |         5 |            1 |
| https://doi.org/10.5281/zenodo.16980661    |         2 |            1 |
| https://doi.org/10.5281/zenodo.16980386    |         1 |            6 |
| https://doi.org/10.5281/zenodo.14044640    |        10 |            1 |
| https://doi.org/10.5281/zenodo.16992716    |         1 |            1 |
| https://doi.org/10.5281/zenodo.17092348    |         5 |            2 |
| https://doi.org/10.5281/zenodo.16993649    |         1 |            1 |
| https://doi.org/10.5281/zenodo.17092303    |         4 |            2 |
| https://doi.org/10.5281/zenodo.14909526    |        10 |            1 |
| https://doi.org/10.5281/zenodo.11109616    |         3 |            1 |
| https://doi.org/10.5281/zenodo.17093454    |         8 |            2 |
| https://doi.org/10.5281/zenodo.17103962    |         5 |            2 |
| https://doi.org/10.5281/zenodo.16991961    |         1 |            1 |
| https://doi.org/10.5281/zenodo.14013026    |         5 |            1 |
| https://doi.org/10.5281/zenodo.16735885    |         5 |            2 |

*** Records by institution (affiliation)
:PROPERTIES:
:ID:       a912f0e1-3273-46b7-b664-f8ed560028d2
:END:

#+begin_src sparql 
  PREFIX owl: <http://www.w3.org/2002/07/owl#>
  PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#>
  PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#>
  prefix dcite: <https://schema.datacite.org/meta/kernel-4.6/metadata.xsd#>
  prefix nfdicore: <https://nfdi.fiz-karlsruhe.de/ontology/>
  select ?institution (count(distinct ?record) as ?nrecords)
  where

  {
    ?record dcite:creator ?creator .
    ?creator dcite:affiliation ?institution .
    filter(isiri(?institution))
  }
  group by ?institution
  order by desc(?nrecords)
#+end_src

#+RESULTS:
| institution               | nrecords |
|---------------------------+----------|
| https://ror.org/01vnkaz16 |       86 |
| https://ror.org/042aqky30 |       44 |
| https://ror.org/03s7gtk40 |       35 |
| https://ror.org/05tpnw772 |       33 |
| https://ror.org/04cdgtt98 |       27 |
| https://ror.org/024z2rq82 |       25 |
| https://ror.org/0546hnb39 |       22 |
| https://ror.org/00rcxh774 |       16 |
| https://ror.org/000h6jb29 |       14 |
| https://ror.org/04c4bwh63 |       13 |
| https://ror.org/034waa237 |        9 |
| https://ror.org/023b0x485 |        8 |
| https://ror.org/04qmmjx98 |        8 |
| https://ror.org/00pd74e08 |        7 |
| https://ror.org/05d78xc36 |        6 |
| https://ror.org/0245cg223 |        5 |
| https://ror.org/04v4h0v24 |        5 |
| https://ror.org/0534re684 |        5 |
| https://ror.org/013czdx64 |        4 |
| https://ror.org/01zwmgk08 |        4 |
| https://ror.org/038t36y30 |        4 |
| https://ror.org/0030f2a11 |        3 |
| https://ror.org/01f5dqg10 |        3 |
| https://ror.org/01v7r4v08 |        3 |
| https://ror.org/02nv7yv05 |        3 |
| https://ror.org/02s376052 |        3 |
| https://ror.org/03a4sp974 |        3 |
| https://ror.org/03fqpzb44 |        3 |
| https://ror.org/04ers2y35 |        3 |
| https://ror.org/004hd5y14 |        2 |
| https://ror.org/00r0qs524 |        2 |
| https://ror.org/014nnvj65 |        2 |
| https://ror.org/02catss52 |        2 |
| https://ror.org/02h2x0161 |        2 |
| https://ror.org/02se0t636 |        2 |
| https://ror.org/03h2bxq36 |        2 |
| https://ror.org/04xx1tc24 |        2 |
| https://ror.org/055s37c97 |        2 |
| https://ror.org/00ggpsq73 |        1 |
| https://ror.org/00v34f693 |        1 |
| https://ror.org/00vn06n10 |        1 |
| https://ror.org/01k8bwd50 |        1 |
| https://ror.org/01k97gp34 |        1 |
| https://ror.org/01y9bpm73 |        1 |
| https://ror.org/01zjc6908 |        1 |
| https://ror.org/0259fwx54 |        1 |
| https://ror.org/02778hg05 |        1 |
| https://ror.org/02jhqqg57 |        1 |
| https://ror.org/0305k8y39 |        1 |
| https://ror.org/0327sr118 |        1 |
| https://ror.org/03a1kwz48 |        1 |
| https://ror.org/03av75f26 |        1 |
| https://ror.org/03mstc592 |        1 |
| https://ror.org/04mz5ra38 |        1 |
| https://ror.org/05745n787 |        1 |
| https://ror.org/05mxhda18 |        1 |
| https://ror.org/05nfk7108 |        1 |
| https://ror.org/05qj6w324 |        1 |
| https://ror.org/05qpz1x62 |        1 |
| https://ror.org/05wwzbv21 |        1 |

*** Records by creator
:PROPERTIES:
:ID:       2f1a50dd-cb6d-468a-9c16-a048e95bc503
:END:

#+begin_src sparql 
  PREFIX owl: <http://www.w3.org/2002/07/owl#>
  PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#>
  PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#>
  prefix dcite: <https://schema.datacite.org/meta/kernel-4.6/metadata.xsd#>
  prefix nfdicore: <https://nfdi.fiz-karlsruhe.de/ontology/>
  select ?creator (count(distinct ?record) as ?nrecords)
  where
  
  {
    ?record dcite:creator ?creator .
    ?creator dcite:familyName ?name .
  }
  group by ?creator
  order by desc(?nrecords)
#+end_src

#+RESULTS:
| creator                               | nrecords |
|---------------------------------------+----------|
| https://orcid.org/0000-0001-5949-2327 |       35 |
| https://orcid.org/0000-0003-4028-811X |       31 |
| https://orcid.org/0000-0001-9568-895X |       20 |
| https://orcid.org/0000-0001-7734-3771 |       16 |
| https://orcid.org/0000-0002-6999-132X |       13 |
| https://orcid.org/0000-0003-2104-9519 |       13 |
| https://orcid.org/0009-0007-5101-4786 |       13 |
| https://orcid.org/0000-0001-5805-5774 |       11 |
| https://orcid.org/0000-0002-6658-2192 |       11 |
| https://orcid.org/0000-0002-5567-8690 |       10 |
| https://orcid.org/0000-0003-3430-2683 |       10 |
| https://orcid.org/0000-0002-3328-9467 |        9 |
| https://orcid.org/0000-0002-5332-3589 |        9 |
| https://orcid.org/0000-0002-8367-5163 |        9 |
| https://orcid.org/0000-0001-6523-7496 |        8 |
| https://orcid.org/0000-0002-3879-7057 |        8 |
| https://orcid.org/0000-0003-2408-7588 |        8 |
| https://orcid.org/0000-0003-3780-8663 |        8 |
| https://orcid.org/0000-0002-5862-6132 |        6 |
| https://orcid.org/0000-0001-7769-0167 |        5 |
| https://orcid.org/0000-0002-4101-6987 |        5 |
| https://orcid.org/0000-0003-1717-3138 |        5 |
| https://orcid.org/0000-0001-9629-0564 |        4 |
| https://orcid.org/0000-0002-2579-5546 |        4 |
| https://orcid.org/0000-0002-5497-6266 |        4 |
| https://orcid.org/0000-0002-6626-2463 |        4 |
| https://orcid.org/0000-0002-6990-4716 |        4 |
| https://orcid.org/0000-0002-7059-4030 |        4 |
| https://orcid.org/0009-0002-1826-7099 |        4 |
| https://orcid.org/0000-0001-8665-6382 |        3 |
| https://orcid.org/0000-0002-1964-4960 |        3 |
| https://orcid.org/0000-0002-2101-8416 |        3 |
| https://orcid.org/0000-0002-3079-6586 |        3 |
| https://orcid.org/0000-0002-4382-5104 |        3 |
| https://orcid.org/0000-0002-5467-871X |        3 |
| https://orcid.org/0000-0002-7452-1146 |        3 |
| https://orcid.org/0000-0002-9051-3701 |        3 |
| https://orcid.org/0000-0003-1323-3762 |        3 |
| https://orcid.org/0000-0003-2778-7483 |        3 |
| https://orcid.org/0009-0003-6932-023X |        3 |
| https://orcid.org/0000-0001-6178-2884 |        2 |
| https://orcid.org/0000-0001-9324-3236 |        2 |
| https://orcid.org/0000-0002-0723-6038 |        2 |
| https://orcid.org/0000-0002-0829-5101 |        2 |
| https://orcid.org/0000-0002-1279-5133 |        2 |
| https://orcid.org/0000-0002-1481-2996 |        2 |
| https://orcid.org/0000-0002-1789-1861 |        2 |
| https://orcid.org/0000-0002-2484-2742 |        2 |
| https://orcid.org/0000-0002-3519-5886 |        2 |
| https://orcid.org/0000-0002-4044-9166 |        2 |
| https://orcid.org/0000-0002-4526-2472 |        2 |
| https://orcid.org/0000-0002-5546-5521 |        2 |
| https://orcid.org/0000-0002-6075-0757 |        2 |
| https://orcid.org/0000-0002-6165-4679 |        2 |
| https://orcid.org/0000-0002-6243-2568 |        2 |
| https://orcid.org/0000-0002-9845-6393 |        2 |
| https://orcid.org/0000-0003-1945-6342 |        2 |
| https://orcid.org/0000-0003-3002-8170 |        2 |
| https://orcid.org/0000-0003-3099-618X |        2 |
| https://orcid.org/0009-0007-5222-2683 |        2 |
| b0                                    |        1 |
| b1                                    |        1 |
| b2                                    |        1 |
| b3                                    |        1 |
| b4                                    |        1 |
| b5                                    |        1 |
| b6                                    |        1 |
| b7                                    |        1 |
| b8                                    |        1 |
| b9                                    |        1 |
| b10                                   |        1 |
| b11                                   |        1 |
| b12                                   |        1 |
| b13                                   |        1 |
| b14                                   |        1 |
| b15                                   |        1 |
| b16                                   |        1 |
| b17                                   |        1 |
| b18                                   |        1 |
| b19                                   |        1 |
| b20                                   |        1 |
| b21                                   |        1 |
| b22                                   |        1 |
| b23                                   |        1 |
| b24                                   |        1 |
| b25                                   |        1 |
| b26                                   |        1 |
| b27                                   |        1 |
| b28                                   |        1 |
| b29                                   |        1 |
| b30                                   |        1 |
| https://orcid.org/0000-0001-5246-9351 |        1 |
| https://orcid.org/0000-0001-5525-5973 |        1 |
| https://orcid.org/0000-0001-5655-0130 |        1 |
| https://orcid.org/0000-0001-6107-567X |        1 |
| https://orcid.org/0000-0001-6919-3646 |        1 |
| https://orcid.org/0000-0001-6966-0814 |        1 |
| https://orcid.org/0000-0001-7250-3756 |        1 |
| https://orcid.org/0000-0001-7276-776X |        1 |
| https://orcid.org/0000-0001-7292-8308 |        1 |
| https://orcid.org/0000-0001-7553-905X |        1 |
| https://orcid.org/0000-0001-7713-024X |        1 |
| https://orcid.org/0000-0001-8528-9023 |        1 |
| https://orcid.org/0000-0001-8698-5389 |        1 |
| https://orcid.org/0000-0001-8736-8796 |        1 |
| https://orcid.org/0000-0001-9021-3197 |        1 |
| https://orcid.org/0000-0001-9227-9798 |        1 |
| https://orcid.org/0000-0001-9274-2578 |        1 |
| https://orcid.org/0000-0001-9309-7531 |        1 |
| https://orcid.org/0000-0001-9734-9767 |        1 |
| https://orcid.org/0000-0001-9773-4008 |        1 |
| https://orcid.org/0000-0001-9868-4671 |        1 |
| https://orcid.org/0000-0001-9993-533X |        1 |
| https://orcid.org/0000-0002-0024-5046 |        1 |
| https://orcid.org/0000-0002-0347-7838 |        1 |
| https://orcid.org/0000-0002-0550-7463 |        1 |
| https://orcid.org/0000-0002-1355-5043 |        1 |
| https://orcid.org/0000-0002-1784-2920 |        1 |
| https://orcid.org/0000-0002-2068-4695 |        1 |
| https://orcid.org/0000-0002-2198-5262 |        1 |
| https://orcid.org/0000-0002-2217-7558 |        1 |
| https://orcid.org/0000-0002-2382-9722 |        1 |
| https://orcid.org/0000-0002-2542-0867 |        1 |
| https://orcid.org/0000-0002-2902-7165 |        1 |
| https://orcid.org/0000-0002-3085-7457 |        1 |
| https://orcid.org/0000-0002-3333-9129 |        1 |
| https://orcid.org/0000-0002-3439-1674 |        1 |
| https://orcid.org/0000-0002-3885-5253 |        1 |
| https://orcid.org/0000-0002-4182-7560 |        1 |
| https://orcid.org/0000-0002-4232-4543 |        1 |
| https://orcid.org/0000-0002-4375-0691 |        1 |
| https://orcid.org/0000-0002-4378-6061 |        1 |
| https://orcid.org/0000-0002-4392-8154 |        1 |
| https://orcid.org/0000-0002-4482-6010 |        1 |
| https://orcid.org/0000-0002-4666-9610 |        1 |
| https://orcid.org/0000-0002-4894-1913 |        1 |
| https://orcid.org/0000-0002-5192-126X |        1 |
| https://orcid.org/0000-0002-5444-5246 |        1 |
| https://orcid.org/0000-0002-5513-954X |        1 |
| https://orcid.org/0000-0002-5857-1477 |        1 |
| https://orcid.org/0000-0002-5884-4471 |        1 |
| https://orcid.org/0000-0002-6027-0796 |        1 |
| https://orcid.org/0000-0002-6209-2364 |        1 |
| https://orcid.org/0000-0002-6574-2588 |        1 |
| https://orcid.org/0000-0002-6586-7129 |        1 |
| https://orcid.org/0000-0002-6634-9729 |        1 |
| https://orcid.org/0000-0002-6681-1530 |        1 |
| https://orcid.org/0000-0002-7018-0460 |        1 |
| https://orcid.org/0000-0002-7390-8795 |        1 |
| https://orcid.org/0000-0002-8251-1597 |        1 |
| https://orcid.org/0000-0002-8500-1357 |        1 |
| https://orcid.org/0000-0002-8516-8034 |        1 |
| https://orcid.org/0000-0002-8818-7193 |        1 |
| https://orcid.org/0000-0002-9071-2356 |        1 |
| https://orcid.org/0000-0002-9134-5295 |        1 |
| https://orcid.org/0000-0002-9397-8475 |        1 |
| https://orcid.org/0000-0002-9574-9553 |        1 |
| https://orcid.org/0000-0002-9723-9063 |        1 |
| https://orcid.org/0000-0003-1334-6388 |        1 |
| https://orcid.org/0000-0003-1379-7023 |        1 |
| https://orcid.org/0000-0003-1896-9031 |        1 |
| https://orcid.org/0000-0003-2237-1147 |        1 |
| https://orcid.org/0000-0003-2370-3430 |        1 |
| https://orcid.org/0000-0003-2380-8830 |        1 |
| https://orcid.org/0000-0003-2528-5391 |        1 |
| https://orcid.org/0000-0003-2547-933X |        1 |
| https://orcid.org/0000-0003-2778-6624 |        1 |
| https://orcid.org/0000-0003-3001-1491 |        1 |
| https://orcid.org/0000-0003-3385-4232 |        1 |
| https://orcid.org/0000-0003-3399-7532 |        1 |
| https://orcid.org/0000-0003-3667-187X |        1 |
| https://orcid.org/0000-0003-3763-0797 |        1 |
| https://orcid.org/0000-0003-3925-6778 |        1 |
| https://orcid.org/0000-0003-4025-1712 |        1 |
| https://orcid.org/0000-0003-4043-165X |        1 |
| https://orcid.org/0000-0003-4105-1990 |        1 |
| https://orcid.org/0000-0003-4328-7171 |        1 |
| https://orcid.org/0000-0003-4358-2269 |        1 |
| https://orcid.org/0000-0003-4726-2481 |        1 |
| https://orcid.org/0000-0003-4813-5927 |        1 |
| https://orcid.org/0009-0002-1414-3291 |        1 |
| https://orcid.org/0009-0004-5318-5966 |        1 |
| https://orcid.org/0009-0005-1758-1790 |        1 |
| https://orcid.org/0009-0009-8508-8585 |        1 |

* Updates
:PROPERTIES:
:ID:       c79f2902-4952-40c6-afef-1d5c7596958b
:END:

** Updating the zenodo community graph
:PROPERTIES:
:ID:       51a67e29-d556-4185-8e0f-331cbd2285df
:END:
[[file:N4BI_zenodo_community/readme.org][N4BI_zenodo_community/readme.org]]

** Updating the services graph
:PROPERTIES:
:ID:       7a49c59d-4169-49aa-94f5-36acbcf73f2c
:END:
[[file:N4BI_Services/readme.org][N4BI_Services/readme.org]]

** Update core graph
:PROPERTIES:
:ID:       beec031b-ff16-4775-9787-c4e496a206eb
:END:
[[file:N4BI_core/readme.org][N4BI_core/readme.org]]

** Update nfdicore ontology
:PROPERTIES:
:ID:       dda0ca04-9f7e-4b8d-9083-7a3fc76eadca
:END:

*** Affected terms
:PROPERTIES:
:ID:       64427198-2322-481d-90c0-996a89055036
:END:
Find all terms from the nfdi core ontology used in our KG and check if they are still present in the most recent nfdicore version (3.0.5)
#+name: query affected terms
#+begin_src sparql :url http://kg.nfdi4bioimage.de/N4BIKG/query

  prefix nfdicore: <https://nfdi.fiz-karlsruhe.de/ontology/NFDI_>
  select ?g ?s ?p ?o where {
    graph ?g {?s ?p ?o}

    values ?g {
      <https://kg.nfdi4bioimage.de/n4bikg/core>
      <https://kg.nfdi4bioimage.de/n4bikg/services>
      <https://kg.nfdi4bioimage.de/n4bikg/n4bi_zenodo_community>
    }

    bind(concat(str(?p), str(?o)) as ?spo)
    filter(contains(?spo, str(nfdicore:)))
    }
#+end_src

#+RESULTS: query affected terms
| g                                                        | s                                            | p                                                   | o                                                   |
|----------------------------------------------------------+----------------------------------------------+-----------------------------------------------------+-----------------------------------------------------|
| https://kg.nfdi4bioimage.de/n4bikg/services              | https://omero-nfdi.uni-muenster.de           | http://www.w3.org/1999/02/22-rdf-syntax-ns#type     | https://nfdi.fiz-karlsruhe.de/ontology/NFDI_0000001 |
| https://kg.nfdi4bioimage.de/n4bikg/services              | https://omero-nfdi.uni-muenster.de           | https://nfdi.fiz-karlsruhe.de/ontology/NFDI_0000201 | https://omero-nfdi.uni-muenster.de/vkg/sparql       |
| https://kg.nfdi4bioimage.de/n4bikg/services              | https://evolomero.evolbio.mpg.de             | http://www.w3.org/1999/02/22-rdf-syntax-ns#type     | https://nfdi.fiz-karlsruhe.de/ontology/NFDI_0000001 |
| https://kg.nfdi4bioimage.de/n4bikg/services              | https://evolomero.evolbio.mpg.de             | https://nfdi.fiz-karlsruhe.de/ontology/NFDI_0000201 | https://evolomero.evolbio.mpg.de/vkg/sparql         |
| https://kg.nfdi4bioimage.de/n4bikg/services              | https://omero-training.gerbi-gmb.de/         | http://www.w3.org/1999/02/22-rdf-syntax-ns#type     | https://nfdi.fiz-karlsruhe.de/ontology/NFDI_0000001 |
| https://kg.nfdi4bioimage.de/n4bikg/services              | https://omero-tim.gerbi-gmb.de               | http://www.w3.org/1999/02/22-rdf-syntax-ns#type     | https://nfdi.fiz-karlsruhe.de/ontology/NFDI_0000001 |
| https://kg.nfdi4bioimage.de/n4bikg/n4bi_zenodo_community | https://nfdi4bioimage.de/rdf/node            | https://nfdi.fiz-karlsruhe.de/ontology/NFDI_0000195 | https://zenodo.org/communities/nfdi4bioimage        |
| https://kg.nfdi4bioimage.de/n4bikg/n4bi_zenodo_community | https://zenodo.org/communities/nfdi4bioimage | https://nfdi.fiz-karlsruhe.de/ontology/NFDI_0001008 | https://zenodo.org/communities/nfdi4bioimage        |

*** Load most recent version
:PROPERTIES:
:ID:       4a2a57c3-406d-497e-87d0-c5a9952b5aeb
:END:
#+begin_src python :session rdf :results output table

  nfdicore = Graph()
  nfdicore.parse("https://ise-fizkarlsruhe.github.io/nfdicore/ontology.ttl")

  # Check properties
  object_properties = nfdicore.query("select ?p where {?p a owl:ObjectProperty. }").serialize(format='csv').decode('utf8').split("\r\n")[1:]
  for test_prop in [
          "https://nfdi.fiz-karlsruhe.de/ontology/NFDI_0000201",
          "https://nfdi.fiz-karlsruhe.de/ontology/NFDI_0000195",
          "https://nfdi.fiz-karlsruhe.de/ontology/NFDI_0001008"]:
      print(test_prop, test_prop in object_properties)

  classes = nfdicore.query("select ?p where {?p a owl:Class. }").serialize(format='csv').decode('utf8').split("\r\n")[1:]

  print("https://nfdi.fiz-karlsruhe.de/ontology/NFDI_0000001", "https://nfdi.fiz-karlsruhe.de/ontology/NFDI_0000001" in classes)
#+end_src

#+RESULTS:
: https://nfdi.fiz-karlsruhe.de/ontology/NFDI_0000201 False
: https://nfdi.fiz-karlsruhe.de/ontology/NFDI_0000195 False
: https://nfdi.fiz-karlsruhe.de/ontology/NFDI_0001008 False
: https://nfdi.fiz-karlsruhe.de/ontology/NFDI_0000001 True


*** DONE Need to replace the three properties[3/3]
CLOSED: [2026-06-05 Fri 12:27]
:PROPERTIES:
:ID:       3faedb6a-be5d-4da7-8a9c-5bb9a5b4acaa
:header-args:sparql: :url http://kg.nfdi4bioimage.de/N4BIKG/sparql
:END:

**** DONE NFDI_0000201
CLOSED: [2026-06-05 Fri 11:10]
:PROPERTIES:
:ID:       9cce5cf8-c72a-4209-baa8-a9f14d688bdf
:END:
#+begin_src sparql
  select * where {
    <https://nfdi.fiz-karlsruhe.de/ontology/NFDI_0000201> ?prop ?val .
    }
#+end_src

#+RESULTS:
| prop                                                | val                                                          |
|-----------------------------------------------------+--------------------------------------------------------------|
| http://www.w3.org/1999/02/22-rdf-syntax-ns#type     | http://www.w3.org/2002/07/owl#ObjectProperty                 |
| http://www.w3.org/2000/01/rdf-schema#label          | has sparql endpoint                                          |
| http://www.w3.org/2000/01/rdf-schema#comment        | The property relates a data resource to its SPARQL Endpoint. |
| http://www.w3.org/2000/01/rdf-schema#subPropertyOf  | https://nfdi.fiz-karlsruhe.de/ontology/NFDI_0000226          |
| https://nfdi.fiz-karlsruhe.de/ontology/NFDI_0000012 | sparqlEndpoint                                               |
| http://www.w3.org/2002/07/owl#inverseOf             | https://nfdi.fiz-karlsruhe.de/ontology/NFDI_0000202          |

#+begin_src bash :results output raw :cache no
  arq --data https://ise-fizkarlsruhe.github.io/nfdicore/ontology.ttl " 
  prefix nfdicore: <https://nfdi.fiz-karlsruhe.de/ontology/NFDI_> 
  prefix owl: <http://www.w3.org/2002/07/owl#>
  prefix rdfs: <http://www.w3.org/2000/01/rdf-schema#>
  select * where { 
      ?prop a owl:ObjectProperty .
      ?prop rdfs:label ?label .
      filter(contains(?label, \"sparql\"))
  } "
#+end_src

#+RESULTS:
----------------
| prop | label |
================

no alternative in nfdi core. looking up ols, returns dcat:acessURL

***** sparql updates (eval in fuseki online, requires admin login)
:PROPERTIES:
:ID:       edbeda6b-cff1-4d64-91df-4bc2f9dbcf36
:END:
#+begin_src sparql :eval no
  <<prefixes>>
  prefix n4bikg: <https://kg.nfdi4bioimage.de/n4bikg/>
  prefix dcat: <http://www.w3.org/ns/dcat#>

  delete { graph n4bikg:services {?s nfdicore:NFDI_0000201 ?val}}
  insert {graph n4bikg:services {?s dcat:accesURL ?val}}
  where {
    graph n4bikg:services {?s nfdicore:NFDI_0000201 ?val} .
  }
#+end_src

**** DONE NFDI_000195 (op)
CLOSED: [2026-06-05 Fri 11:10]
:PROPERTIES:
:ID:       ed2a3b37-83ce-49e8-adbf-88b9db47e869
:END:
- affected graph: n4bi_zenodo_community
- affected terms

#+begin_src sparql :noweb-ref prefixes
  prefix n4bikg: <https://kg.nfdi4bioimage.de/n4bikg/>
  prefix dcat: <http://www.w3.org/ns/dcat#>
  PREFIX schema:     <http://schema.org/>
#+end_src

#+begin_src sparql
  <<prefixes>>
  select * where {
    {
    graph n4bikg:n4bi_zenodo_community {?s nfdicore:NFDI_0000195 ?o}
      }
    union {
      graph n4bikg:owl { nfdicore:NFDI_0000195 rdfs:label ?label195}
      }
   }
#+end_src

#+RESULTS:
| s                                 | o                                            | label195              |
|-----------------------------------+----------------------------------------------+-----------------------|
| https://nfdi4bioimage.de/rdf/node | https://zenodo.org/communities/nfdi4bioimage |                       |
|                                   |                                              | represents collection |

will replace by (zenodo_communit provo:wasAttributedTo n4bi)

***** sparql update
:PROPERTIES:
:ID:       9234f400-8b02-4471-b2f6-f0fedd6e703a
:END:
#+begin_src sparql :eval no
  <<prefixes>>
  prefix prov <https://www.w3.org/TR/prov-o/#>

  delete {
    graph n4bikg:n4bi_zenodo_community {?s nfdicore:NFDI_0000195 ?collection}
    }
  insert {
    graph n4bikg:n4bi_zenodo_community {?collection prov:wasAttributedTo ?s;
                                                    a prov:Collection .}
    }
  where {
    graph n4bikg:n4bi_zenodo_community {?s nfdicore:NFDI_0000195 ?collection}
    }
  
#+end_src

***** check
:PROPERTIES:
:ID:       f29c36d6-44e7-430b-8b57-bc4ccd334a0a
:END:
#+begin_src sparql
  <<prefixes>>
  prefix prov: <https://www.w3.org/TR/prov-o/#>
  select * where {
    optional
    {
    graph n4bikg:n4bi_zenodo_community {?s nfdicore:NFDI_0000195 ?collection}
    }
    optional {
    graph n4bikg:n4bi_zenodo_community {?s ^prov:wasAttributedTo ?collection .
                                        ?collection ?prop ?val .}
    }
    }
#+end_src

#+RESULTS:
| s                                 | collection                                   | prop                                                | val                                          |
|-----------------------------------+----------------------------------------------+-----------------------------------------------------+----------------------------------------------|
| https://nfdi4bioimage.de/rdf/node | https://zenodo.org/communities/nfdi4bioimage | http://www.w3.org/1999/02/22-rdf-syntax-ns#type     | https://www.w3.org/TR/prov-o/#Collection     |
| https://nfdi4bioimage.de/rdf/node | https://zenodo.org/communities/nfdi4bioimage | https://nfdi.fiz-karlsruhe.de/ontology/NFDI_0001008 | https://zenodo.org/communities/nfdi4bioimage |
| https://nfdi4bioimage.de/rdf/node | https://zenodo.org/communities/nfdi4bioimage | http://purl.org/dc/elements/1.1/identifier          | nfdi4bioimage                                |
| https://nfdi4bioimage.de/rdf/node | https://zenodo.org/communities/nfdi4bioimage | http://semanticscience.org/resource/SIO_000088      | https://doi.org/10.5281/zenodo.15268798      |
| https://nfdi4bioimage.de/rdf/node | https://zenodo.org/communities/nfdi4bioimage | http://semanticscience.org/resource/SIO_000088      | https://doi.org/10.5281/zenodo.11261115      |
| https://nfdi4bioimage.de/rdf/node | https://zenodo.org/communities/nfdi4bioimage | http://semanticscience.org/resource/SIO_000088      | https://doi.org/10.5281/zenodo.8434325       |
| https://nfdi4bioimage.de/rdf/node | https://zenodo.org/communities/nfdi4bioimage | http://semanticscience.org/resource/SIO_000088      | https://doi.org/10.5281/zenodo.8414319       |
| https://nfdi4bioimage.de/rdf/node | https://zenodo.org/communities/nfdi4bioimage | http://semanticscience.org/resource/SIO_000088      | https://doi.org/10.5281/zenodo.8349563       |
| https://nfdi4bioimage.de/rdf/node | https://zenodo.org/communities/nfdi4bioimage | http://semanticscience.org/resource/SIO_000088      | https://doi.org/10.5281/zenodo.8340248       |
| https://nfdi4bioimage.de/rdf/node | https://zenodo.org/communities/nfdi4bioimage | http://semanticscience.org/resource/SIO_000088      | https://doi.org/10.5281/zenodo.8329306       |
| https://nfdi4bioimage.de/rdf/node | https://zenodo.org/communities/nfdi4bioimage | http://semanticscience.org/resource/SIO_000088      | https://doi.org/10.5281/zenodo.8139354       |
| https://nfdi4bioimage.de/rdf/node | https://zenodo.org/communities/nfdi4bioimage | http://semanticscience.org/resource/SIO_000088      | https://doi.org/10.5281/zenodo.8070038       |
| https://nfdi4bioimage.de/rdf/node | https://zenodo.org/communities/nfdi4bioimage | http://semanticscience.org/resource/SIO_000088      | https://doi.org/10.5281/zenodo.8019760       |
| https://nfdi4bioimage.de/rdf/node | https://zenodo.org/communities/nfdi4bioimage | http://semanticscience.org/resource/SIO_000088      | https://doi.org/10.5281/zenodo.7928333       |
| https://nfdi4bioimage.de/rdf/node | https://zenodo.org/communities/nfdi4bioimage | http://semanticscience.org/resource/SIO_000088      | https://doi.org/10.5281/zenodo.7890311       |
| https://nfdi4bioimage.de/rdf/node | https://zenodo.org/communities/nfdi4bioimage | http://semanticscience.org/resource/SIO_000088      | https://doi.org/10.5281/zenodo.7656540       |
| https://nfdi4bioimage.de/rdf/node | https://zenodo.org/communities/nfdi4bioimage | http://semanticscience.org/resource/SIO_000088      | https://doi.org/10.5281/zenodo.7394675       |
| https://nfdi4bioimage.de/rdf/node | https://zenodo.org/communities/nfdi4bioimage | http://semanticscience.org/resource/SIO_000088      | https://doi.org/10.5281/zenodo.7082609       |
| https://nfdi4bioimage.de/rdf/node | https://zenodo.org/communities/nfdi4bioimage | http://semanticscience.org/resource/SIO_000088      | https://doi.org/10.5281/zenodo.7082514       |
| https://nfdi4bioimage.de/rdf/node | https://zenodo.org/communities/nfdi4bioimage | http://semanticscience.org/resource/SIO_000088      | https://doi.org/10.5281/zenodo.7015307       |
| https://nfdi4bioimage.de/rdf/node | https://zenodo.org/communities/nfdi4bioimage | http://semanticscience.org/resource/SIO_000088      | https://doi.org/10.5281/zenodo.6560026       |
| https://nfdi4bioimage.de/rdf/node | https://zenodo.org/communities/nfdi4bioimage | http://semanticscience.org/resource/SIO_000088      | https://doi.org/10.5281/zenodo.6504714       |
| https://nfdi4bioimage.de/rdf/node | https://zenodo.org/communities/nfdi4bioimage | http://semanticscience.org/resource/SIO_000088      | https://doi.org/10.5281/zenodo.6504467       |
| https://nfdi4bioimage.de/rdf/node | https://zenodo.org/communities/nfdi4bioimage | http://semanticscience.org/resource/SIO_000088      | https://doi.org/10.5281/zenodo.6504208       |
| https://nfdi4bioimage.de/rdf/node | https://zenodo.org/communities/nfdi4bioimage | http://semanticscience.org/resource/SIO_000088      | https://doi.org/10.5281/zenodo.6501614       |
| https://nfdi4bioimage.de/rdf/node | https://zenodo.org/communities/nfdi4bioimage | http://semanticscience.org/resource/SIO_000088      | https://doi.org/10.5281/zenodo.5101158       |
| https://nfdi4bioimage.de/rdf/node | https://zenodo.org/communities/nfdi4bioimage | http://semanticscience.org/resource/SIO_000088      | https://doi.org/10.5281/zenodo.15423904      |
| https://nfdi4bioimage.de/rdf/node | https://zenodo.org/communities/nfdi4bioimage | http://semanticscience.org/resource/SIO_000088      | https://doi.org/10.5281/zenodo.15373555      |
| https://nfdi4bioimage.de/rdf/node | https://zenodo.org/communities/nfdi4bioimage | http://semanticscience.org/resource/SIO_000088      | https://doi.org/10.5281/zenodo.15308773      |
| https://nfdi4bioimage.de/rdf/node | https://zenodo.org/communities/nfdi4bioimage | http://semanticscience.org/resource/SIO_000088      | https://doi.org/10.5281/zenodo.15225616      |
| https://nfdi4bioimage.de/rdf/node | https://zenodo.org/communities/nfdi4bioimage | http://semanticscience.org/resource/SIO_000088      | https://doi.org/10.5281/zenodo.15152576      |
| https://nfdi4bioimage.de/rdf/node | https://zenodo.org/communities/nfdi4bioimage | http://semanticscience.org/resource/SIO_000088      | https://doi.org/10.5281/zenodo.15083018      |
| https://nfdi4bioimage.de/rdf/node | https://zenodo.org/communities/nfdi4bioimage | http://semanticscience.org/resource/SIO_000088      | https://doi.org/10.5281/zenodo.15065070      |
| https://nfdi4bioimage.de/rdf/node | https://zenodo.org/communities/nfdi4bioimage | http://semanticscience.org/resource/SIO_000088      | https://doi.org/10.5281/zenodo.15047849      |
| https://nfdi4bioimage.de/rdf/node | https://zenodo.org/communities/nfdi4bioimage | http://semanticscience.org/resource/SIO_000088      | https://doi.org/10.5281/zenodo.15033241      |
| https://nfdi4bioimage.de/rdf/node | https://zenodo.org/communities/nfdi4bioimage | http://semanticscience.org/resource/SIO_000088      | https://doi.org/10.5281/zenodo.15031842      |
| https://nfdi4bioimage.de/rdf/node | https://zenodo.org/communities/nfdi4bioimage | http://semanticscience.org/resource/SIO_000088      | https://doi.org/10.5281/zenodo.15026373      |
| https://nfdi4bioimage.de/rdf/node | https://zenodo.org/communities/nfdi4bioimage | http://semanticscience.org/resource/SIO_000088      | https://doi.org/10.5281/zenodo.14999220      |
| https://nfdi4bioimage.de/rdf/node | https://zenodo.org/communities/nfdi4bioimage | http://semanticscience.org/resource/SIO_000088      | https://doi.org/10.5281/zenodo.14998017      |
| https://nfdi4bioimage.de/rdf/node | https://zenodo.org/communities/nfdi4bioimage | http://semanticscience.org/resource/SIO_000088      | https://doi.org/10.5281/zenodo.14997835      |
| https://nfdi4bioimage.de/rdf/node | https://zenodo.org/communities/nfdi4bioimage | http://semanticscience.org/resource/SIO_000088      | https://doi.org/10.5281/zenodo.14988921      |
| https://nfdi4bioimage.de/rdf/node | https://zenodo.org/communities/nfdi4bioimage | http://semanticscience.org/resource/SIO_000088      | https://doi.org/10.5281/zenodo.14979253      |
| https://nfdi4bioimage.de/rdf/node | https://zenodo.org/communities/nfdi4bioimage | http://semanticscience.org/resource/SIO_000088      | https://doi.org/10.5281/zenodo.14975462      |
| https://nfdi4bioimage.de/rdf/node | https://zenodo.org/communities/nfdi4bioimage | http://semanticscience.org/resource/SIO_000088      | https://doi.org/10.5281/zenodo.14954254      |
| https://nfdi4bioimage.de/rdf/node | https://zenodo.org/communities/nfdi4bioimage | http://semanticscience.org/resource/SIO_000088      | https://doi.org/10.5281/zenodo.14953098      |
| https://nfdi4bioimage.de/rdf/node | https://zenodo.org/communities/nfdi4bioimage | http://semanticscience.org/resource/SIO_000088      | https://doi.org/10.5281/zenodo.14951142      |
| https://nfdi4bioimage.de/rdf/node | https://zenodo.org/communities/nfdi4bioimage | http://semanticscience.org/resource/SIO_000088      | https://doi.org/10.5281/zenodo.14950686      |
| https://nfdi4bioimage.de/rdf/node | https://zenodo.org/communities/nfdi4bioimage | http://semanticscience.org/resource/SIO_000088      | https://doi.org/10.5281/zenodo.14937632      |
| https://nfdi4bioimage.de/rdf/node | https://zenodo.org/communities/nfdi4bioimage | http://semanticscience.org/resource/SIO_000088      | https://doi.org/10.5281/zenodo.14909526      |
| https://nfdi4bioimage.de/rdf/node | https://zenodo.org/communities/nfdi4bioimage | http://semanticscience.org/resource/SIO_000088      | https://doi.org/10.5281/zenodo.14845059      |
| https://nfdi4bioimage.de/rdf/node | https://zenodo.org/communities/nfdi4bioimage | http://semanticscience.org/resource/SIO_000088      | https://doi.org/10.5281/zenodo.14832855      |
| https://nfdi4bioimage.de/rdf/node | https://zenodo.org/communities/nfdi4bioimage | http://semanticscience.org/resource/SIO_000088      | https://doi.org/10.5281/zenodo.14792534      |
| https://nfdi4bioimage.de/rdf/node | https://zenodo.org/communities/nfdi4bioimage | http://semanticscience.org/resource/SIO_000088      | https://doi.org/10.5281/zenodo.14716546      |
| https://nfdi4bioimage.de/rdf/node | https://zenodo.org/communities/nfdi4bioimage | http://semanticscience.org/resource/SIO_000088      | https://doi.org/10.5281/zenodo.14650434      |
| https://nfdi4bioimage.de/rdf/node | https://zenodo.org/communities/nfdi4bioimage | http://semanticscience.org/resource/SIO_000088      | https://doi.org/10.5281/zenodo.14626054      |
| https://nfdi4bioimage.de/rdf/node | https://zenodo.org/communities/nfdi4bioimage | http://semanticscience.org/resource/SIO_000088      | https://doi.org/10.5281/zenodo.14623257      |
| https://nfdi4bioimage.de/rdf/node | https://zenodo.org/communities/nfdi4bioimage | http://semanticscience.org/resource/SIO_000088      | https://doi.org/10.5281/zenodo.14620253      |
| https://nfdi4bioimage.de/rdf/node | https://zenodo.org/communities/nfdi4bioimage | http://semanticscience.org/resource/SIO_000088      | https://doi.org/10.5281/zenodo.14418209      |
| https://nfdi4bioimage.de/rdf/node | https://zenodo.org/communities/nfdi4bioimage | http://semanticscience.org/resource/SIO_000088      | https://doi.org/10.5281/zenodo.14412107      |
| https://nfdi4bioimage.de/rdf/node | https://zenodo.org/communities/nfdi4bioimage | http://semanticscience.org/resource/SIO_000088      | https://doi.org/10.5281/zenodo.14381522      |
| https://nfdi4bioimage.de/rdf/node | https://zenodo.org/communities/nfdi4bioimage | http://semanticscience.org/resource/SIO_000088      | https://doi.org/10.5281/zenodo.14278058      |
| https://nfdi4bioimage.de/rdf/node | https://zenodo.org/communities/nfdi4bioimage | http://semanticscience.org/resource/SIO_000088      | https://doi.org/10.5281/zenodo.14234608      |
| https://nfdi4bioimage.de/rdf/node | https://zenodo.org/communities/nfdi4bioimage | http://semanticscience.org/resource/SIO_000088      | https://doi.org/10.5281/zenodo.14186101      |
| https://nfdi4bioimage.de/rdf/node | https://zenodo.org/communities/nfdi4bioimage | http://semanticscience.org/resource/SIO_000088      | https://doi.org/10.5281/zenodo.14178789      |
| https://nfdi4bioimage.de/rdf/node | https://zenodo.org/communities/nfdi4bioimage | http://semanticscience.org/resource/SIO_000088      | https://doi.org/10.5281/zenodo.14044640      |
| https://nfdi4bioimage.de/rdf/node | https://zenodo.org/communities/nfdi4bioimage | http://semanticscience.org/resource/SIO_000088      | https://doi.org/10.5281/zenodo.14044380      |
| https://nfdi4bioimage.de/rdf/node | https://zenodo.org/communities/nfdi4bioimage | http://semanticscience.org/resource/SIO_000088      | https://doi.org/10.5281/zenodo.14035822      |
| https://nfdi4bioimage.de/rdf/node | https://zenodo.org/communities/nfdi4bioimage | http://semanticscience.org/resource/SIO_000088      | https://doi.org/10.5281/zenodo.14014252      |
| https://nfdi4bioimage.de/rdf/node | https://zenodo.org/communities/nfdi4bioimage | http://semanticscience.org/resource/SIO_000088      | https://doi.org/10.5281/zenodo.14013026      |
| https://nfdi4bioimage.de/rdf/node | https://zenodo.org/communities/nfdi4bioimage | http://semanticscience.org/resource/SIO_000088      | https://doi.org/10.5281/zenodo.14006558      |
| https://nfdi4bioimage.de/rdf/node | https://zenodo.org/communities/nfdi4bioimage | http://semanticscience.org/resource/SIO_000088      | https://doi.org/10.5281/zenodo.14001388      |
| https://nfdi4bioimage.de/rdf/node | https://zenodo.org/communities/nfdi4bioimage | http://semanticscience.org/resource/SIO_000088      | https://doi.org/10.5281/zenodo.13991322      |
| https://nfdi4bioimage.de/rdf/node | https://zenodo.org/communities/nfdi4bioimage | http://semanticscience.org/resource/SIO_000088      | https://doi.org/10.5281/zenodo.13970736      |
| https://nfdi4bioimage.de/rdf/node | https://zenodo.org/communities/nfdi4bioimage | http://semanticscience.org/resource/SIO_000088      | https://doi.org/10.5281/zenodo.13861026      |
| https://nfdi4bioimage.de/rdf/node | https://zenodo.org/communities/nfdi4bioimage | http://semanticscience.org/resource/SIO_000088      | https://doi.org/10.5281/zenodo.13837146      |
| https://nfdi4bioimage.de/rdf/node | https://zenodo.org/communities/nfdi4bioimage | http://semanticscience.org/resource/SIO_000088      | https://doi.org/10.5281/zenodo.13831274      |
| https://nfdi4bioimage.de/rdf/node | https://zenodo.org/communities/nfdi4bioimage | http://semanticscience.org/resource/SIO_000088      | https://doi.org/10.5281/zenodo.13747937      |
| https://nfdi4bioimage.de/rdf/node | https://zenodo.org/communities/nfdi4bioimage | http://semanticscience.org/resource/SIO_000088      | https://doi.org/10.5281/zenodo.13684187      |
| https://nfdi4bioimage.de/rdf/node | https://zenodo.org/communities/nfdi4bioimage | http://semanticscience.org/resource/SIO_000088      | https://doi.org/10.5281/zenodo.13640979      |
| https://nfdi4bioimage.de/rdf/node | https://zenodo.org/communities/nfdi4bioimage | http://semanticscience.org/resource/SIO_000088      | https://doi.org/10.5281/zenodo.13628852      |
| https://nfdi4bioimage.de/rdf/node | https://zenodo.org/communities/nfdi4bioimage | http://semanticscience.org/resource/SIO_000088      | https://doi.org/10.5281/zenodo.13506641      |
| https://nfdi4bioimage.de/rdf/node | https://zenodo.org/communities/nfdi4bioimage | http://semanticscience.org/resource/SIO_000088      | https://doi.org/10.5281/zenodo.13380289      |
| https://nfdi4bioimage.de/rdf/node | https://zenodo.org/communities/nfdi4bioimage | http://semanticscience.org/resource/SIO_000088      | https://doi.org/10.5281/zenodo.13168693      |
| https://nfdi4bioimage.de/rdf/node | https://zenodo.org/communities/nfdi4bioimage | http://semanticscience.org/resource/SIO_000088      | https://doi.org/10.5281/zenodo.12699637      |
| https://nfdi4bioimage.de/rdf/node | https://zenodo.org/communities/nfdi4bioimage | http://semanticscience.org/resource/SIO_000088      | https://doi.org/10.5281/zenodo.12623730      |
| https://nfdi4bioimage.de/rdf/node | https://zenodo.org/communities/nfdi4bioimage | http://semanticscience.org/resource/SIO_000088      | https://doi.org/10.5281/zenodo.12521485      |
| https://nfdi4bioimage.de/rdf/node | https://zenodo.org/communities/nfdi4bioimage | http://semanticscience.org/resource/SIO_000088      | https://doi.org/10.5281/zenodo.12087272      |
| https://nfdi4bioimage.de/rdf/node | https://zenodo.org/communities/nfdi4bioimage | http://semanticscience.org/resource/SIO_000088      | https://doi.org/10.5281/zenodo.12077569      |
| https://nfdi4bioimage.de/rdf/node | https://zenodo.org/communities/nfdi4bioimage | http://semanticscience.org/resource/SIO_000088      | https://doi.org/10.5281/zenodo.11574994      |
| https://nfdi4bioimage.de/rdf/node | https://zenodo.org/communities/nfdi4bioimage | http://semanticscience.org/resource/SIO_000088      | https://doi.org/10.5281/zenodo.11574435      |
| https://nfdi4bioimage.de/rdf/node | https://zenodo.org/communities/nfdi4bioimage | http://semanticscience.org/resource/SIO_000088      | https://doi.org/10.5281/zenodo.11548617      |
| https://nfdi4bioimage.de/rdf/node | https://zenodo.org/communities/nfdi4bioimage | http://semanticscience.org/resource/SIO_000088      | https://doi.org/10.5281/zenodo.11525313      |
| https://nfdi4bioimage.de/rdf/node | https://zenodo.org/communities/nfdi4bioimage | http://semanticscience.org/resource/SIO_000088      | https://doi.org/10.5281/zenodo.11503289      |
| https://nfdi4bioimage.de/rdf/node | https://zenodo.org/communities/nfdi4bioimage | http://semanticscience.org/resource/SIO_000088      | https://doi.org/10.5281/zenodo.11502721      |
| https://nfdi4bioimage.de/rdf/node | https://zenodo.org/communities/nfdi4bioimage | http://semanticscience.org/resource/SIO_000088      | https://doi.org/10.5281/zenodo.11501662      |
| https://nfdi4bioimage.de/rdf/node | https://zenodo.org/communities/nfdi4bioimage | http://semanticscience.org/resource/SIO_000088      | https://doi.org/10.5281/zenodo.11448638      |
| https://nfdi4bioimage.de/rdf/node | https://zenodo.org/communities/nfdi4bioimage | http://semanticscience.org/resource/SIO_000088      | https://doi.org/10.5281/zenodo.11412513      |
| https://nfdi4bioimage.de/rdf/node | https://zenodo.org/communities/nfdi4bioimage | http://semanticscience.org/resource/SIO_000088      | https://doi.org/10.5281/zenodo.11369042      |
| https://nfdi4bioimage.de/rdf/node | https://zenodo.org/communities/nfdi4bioimage | http://semanticscience.org/resource/SIO_000088      | https://doi.org/10.5281/zenodo.11350689      |
| https://nfdi4bioimage.de/rdf/node | https://zenodo.org/communities/nfdi4bioimage | http://semanticscience.org/resource/SIO_000088      | https://doi.org/10.5281/zenodo.11344132      |
| https://nfdi4bioimage.de/rdf/node | https://zenodo.org/communities/nfdi4bioimage | http://semanticscience.org/resource/SIO_000088      | https://doi.org/10.5281/zenodo.11312181      |
| https://nfdi4bioimage.de/rdf/node | https://zenodo.org/communities/nfdi4bioimage | http://semanticscience.org/resource/SIO_000088      | https://doi.org/10.5281/zenodo.11259495      |
| https://nfdi4bioimage.de/rdf/node | https://zenodo.org/communities/nfdi4bioimage | http://semanticscience.org/resource/SIO_000088      | https://doi.org/10.5281/zenodo.11235513      |
| https://nfdi4bioimage.de/rdf/node | https://zenodo.org/communities/nfdi4bioimage | http://semanticscience.org/resource/SIO_000088      | https://doi.org/10.5281/zenodo.11235081      |
| https://nfdi4bioimage.de/rdf/node | https://zenodo.org/communities/nfdi4bioimage | http://semanticscience.org/resource/SIO_000088      | https://doi.org/10.5281/zenodo.11220181      |
| https://nfdi4bioimage.de/rdf/node | https://zenodo.org/communities/nfdi4bioimage | http://semanticscience.org/resource/SIO_000088      | https://doi.org/10.5281/zenodo.11191762      |
| https://nfdi4bioimage.de/rdf/node | https://zenodo.org/communities/nfdi4bioimage | http://semanticscience.org/resource/SIO_000088      | https://doi.org/10.5281/zenodo.11146807      |
| https://nfdi4bioimage.de/rdf/node | https://zenodo.org/communities/nfdi4bioimage | http://semanticscience.org/resource/SIO_000088      | https://doi.org/10.5281/zenodo.11126631      |
| https://nfdi4bioimage.de/rdf/node | https://zenodo.org/communities/nfdi4bioimage | http://semanticscience.org/resource/SIO_000088      | https://doi.org/10.5281/zenodo.11122233      |
| https://nfdi4bioimage.de/rdf/node | https://zenodo.org/communities/nfdi4bioimage | http://semanticscience.org/resource/SIO_000088      | https://doi.org/10.5281/zenodo.11109616      |
| https://nfdi4bioimage.de/rdf/node | https://zenodo.org/communities/nfdi4bioimage | http://semanticscience.org/resource/SIO_000088      | https://doi.org/10.5281/zenodo.11080237      |
| https://nfdi4bioimage.de/rdf/node | https://zenodo.org/communities/nfdi4bioimage | http://semanticscience.org/resource/SIO_000088      | https://doi.org/10.5281/zenodo.11031747      |
| https://nfdi4bioimage.de/rdf/node | https://zenodo.org/communities/nfdi4bioimage | http://semanticscience.org/resource/SIO_000088      | https://doi.org/10.5281/zenodo.10978831      |
| https://nfdi4bioimage.de/rdf/node | https://zenodo.org/communities/nfdi4bioimage | http://semanticscience.org/resource/SIO_000088      | https://doi.org/10.5281/zenodo.10968458      |
| https://nfdi4bioimage.de/rdf/node | https://zenodo.org/communities/nfdi4bioimage | http://semanticscience.org/resource/SIO_000088      | https://doi.org/10.5281/zenodo.10947701      |
| https://nfdi4bioimage.de/rdf/node | https://zenodo.org/communities/nfdi4bioimage | http://semanticscience.org/resource/SIO_000088      | https://doi.org/10.5281/zenodo.10939520      |
| https://nfdi4bioimage.de/rdf/node | https://zenodo.org/communities/nfdi4bioimage | http://semanticscience.org/resource/SIO_000088      | https://doi.org/10.5281/zenodo.10935236      |
| https://nfdi4bioimage.de/rdf/node | https://zenodo.org/communities/nfdi4bioimage | http://semanticscience.org/resource/SIO_000088      | https://doi.org/10.5281/zenodo.10907116      |
| https://nfdi4bioimage.de/rdf/node | https://zenodo.org/communities/nfdi4bioimage | http://semanticscience.org/resource/SIO_000088      | https://doi.org/10.5281/zenodo.10886750      |
| https://nfdi4bioimage.de/rdf/node | https://zenodo.org/communities/nfdi4bioimage | http://semanticscience.org/resource/SIO_000088      | https://doi.org/10.5281/zenodo.10808486      |
| https://nfdi4bioimage.de/rdf/node | https://zenodo.org/communities/nfdi4bioimage | http://semanticscience.org/resource/SIO_000088      | https://doi.org/10.5281/zenodo.10793700      |
| https://nfdi4bioimage.de/rdf/node | https://zenodo.org/communities/nfdi4bioimage | http://semanticscience.org/resource/SIO_000088      | https://doi.org/10.5281/zenodo.10730424      |
| https://nfdi4bioimage.de/rdf/node | https://zenodo.org/communities/nfdi4bioimage | http://semanticscience.org/resource/SIO_000088      | https://doi.org/10.5281/zenodo.10687659      |
| https://nfdi4bioimage.de/rdf/node | https://zenodo.org/communities/nfdi4bioimage | http://semanticscience.org/resource/SIO_000088      | https://doi.org/10.5281/zenodo.10617006      |
| https://nfdi4bioimage.de/rdf/node | https://zenodo.org/communities/nfdi4bioimage | http://semanticscience.org/resource/SIO_000088      | https://doi.org/10.5281/zenodo.10609771      |
| https://nfdi4bioimage.de/rdf/node | https://zenodo.org/communities/nfdi4bioimage | http://semanticscience.org/resource/SIO_000088      | https://doi.org/10.5281/zenodo.10389955      |
| https://nfdi4bioimage.de/rdf/node | https://zenodo.org/communities/nfdi4bioimage | http://semanticscience.org/resource/SIO_000088      | https://doi.org/10.5281/zenodo.10083555      |
| https://nfdi4bioimage.de/rdf/node | https://zenodo.org/communities/nfdi4bioimage | http://semanticscience.org/resource/SIO_000088      | https://doi.org/10.5281/zenodo.10008465      |
| https://nfdi4bioimage.de/rdf/node | https://zenodo.org/communities/nfdi4bioimage | http://semanticscience.org/resource/SIO_000088      | https://doi.org/10.1038/s41598-019-56067-w   |
| https://nfdi4bioimage.de/rdf/node | https://zenodo.org/communities/nfdi4bioimage | http://semanticscience.org/resource/SIO_000088      | https://doi.org/10.5281/zenodo.17296688      |
| https://nfdi4bioimage.de/rdf/node | https://zenodo.org/communities/nfdi4bioimage | http://semanticscience.org/resource/SIO_000088      | https://doi.org/10.5281/zenodo.17251110      |
| https://nfdi4bioimage.de/rdf/node | https://zenodo.org/communities/nfdi4bioimage | http://semanticscience.org/resource/SIO_000088      | https://doi.org/10.5281/zenodo.17186869      |
| https://nfdi4bioimage.de/rdf/node | https://zenodo.org/communities/nfdi4bioimage | http://semanticscience.org/resource/SIO_000088      | https://doi.org/10.5281/zenodo.17174207      |
| https://nfdi4bioimage.de/rdf/node | https://zenodo.org/communities/nfdi4bioimage | http://semanticscience.org/resource/SIO_000088      | https://doi.org/10.5281/zenodo.17103962      |
| https://nfdi4bioimage.de/rdf/node | https://zenodo.org/communities/nfdi4bioimage | http://semanticscience.org/resource/SIO_000088      | https://doi.org/10.5281/zenodo.17098115      |
| https://nfdi4bioimage.de/rdf/node | https://zenodo.org/communities/nfdi4bioimage | http://semanticscience.org/resource/SIO_000088      | https://doi.org/10.5281/zenodo.17093454      |
| https://nfdi4bioimage.de/rdf/node | https://zenodo.org/communities/nfdi4bioimage | http://semanticscience.org/resource/SIO_000088      | https://doi.org/10.5281/zenodo.17092348      |
| https://nfdi4bioimage.de/rdf/node | https://zenodo.org/communities/nfdi4bioimage | http://semanticscience.org/resource/SIO_000088      | https://doi.org/10.5281/zenodo.17092303      |
| https://nfdi4bioimage.de/rdf/node | https://zenodo.org/communities/nfdi4bioimage | http://semanticscience.org/resource/SIO_000088      | https://doi.org/10.5281/zenodo.17087096      |
| https://nfdi4bioimage.de/rdf/node | https://zenodo.org/communities/nfdi4bioimage | http://semanticscience.org/resource/SIO_000088      | https://doi.org/10.5281/zenodo.17085991      |
| https://nfdi4bioimage.de/rdf/node | https://zenodo.org/communities/nfdi4bioimage | http://semanticscience.org/resource/SIO_000088      | https://doi.org/10.5281/zenodo.17014253      |
| https://nfdi4bioimage.de/rdf/node | https://zenodo.org/communities/nfdi4bioimage | http://semanticscience.org/resource/SIO_000088      | https://doi.org/10.5281/zenodo.16993955      |
| https://nfdi4bioimage.de/rdf/node | https://zenodo.org/communities/nfdi4bioimage | http://semanticscience.org/resource/SIO_000088      | https://doi.org/10.5281/zenodo.16993649      |
| https://nfdi4bioimage.de/rdf/node | https://zenodo.org/communities/nfdi4bioimage | http://semanticscience.org/resource/SIO_000088      | https://doi.org/10.5281/zenodo.16993297      |
| https://nfdi4bioimage.de/rdf/node | https://zenodo.org/communities/nfdi4bioimage | http://semanticscience.org/resource/SIO_000088      | https://doi.org/10.5281/zenodo.16993178      |
| https://nfdi4bioimage.de/rdf/node | https://zenodo.org/communities/nfdi4bioimage | http://semanticscience.org/resource/SIO_000088      | https://doi.org/10.5281/zenodo.16993059      |
| https://nfdi4bioimage.de/rdf/node | https://zenodo.org/communities/nfdi4bioimage | http://semanticscience.org/resource/SIO_000088      | https://doi.org/10.5281/zenodo.16992904      |
| https://nfdi4bioimage.de/rdf/node | https://zenodo.org/communities/nfdi4bioimage | http://semanticscience.org/resource/SIO_000088      | https://doi.org/10.5281/zenodo.16992716      |
| https://nfdi4bioimage.de/rdf/node | https://zenodo.org/communities/nfdi4bioimage | http://semanticscience.org/resource/SIO_000088      | https://doi.org/10.5281/zenodo.16992303      |
| https://nfdi4bioimage.de/rdf/node | https://zenodo.org/communities/nfdi4bioimage | http://semanticscience.org/resource/SIO_000088      | https://doi.org/10.5281/zenodo.16991961      |
| https://nfdi4bioimage.de/rdf/node | https://zenodo.org/communities/nfdi4bioimage | http://semanticscience.org/resource/SIO_000088      | https://doi.org/10.5281/zenodo.16980661      |
| https://nfdi4bioimage.de/rdf/node | https://zenodo.org/communities/nfdi4bioimage | http://semanticscience.org/resource/SIO_000088      | https://doi.org/10.5281/zenodo.16980386      |
| https://nfdi4bioimage.de/rdf/node | https://zenodo.org/communities/nfdi4bioimage | http://semanticscience.org/resource/SIO_000088      | https://doi.org/10.5281/zenodo.16980217      |
| https://nfdi4bioimage.de/rdf/node | https://zenodo.org/communities/nfdi4bioimage | http://semanticscience.org/resource/SIO_000088      | https://doi.org/10.5281/zenodo.16979744      |
| https://nfdi4bioimage.de/rdf/node | https://zenodo.org/communities/nfdi4bioimage | http://semanticscience.org/resource/SIO_000088      | https://doi.org/10.5281/zenodo.16911980      |
| https://nfdi4bioimage.de/rdf/node | https://zenodo.org/communities/nfdi4bioimage | http://semanticscience.org/resource/SIO_000088      | https://doi.org/10.5281/zenodo.16880913      |
| https://nfdi4bioimage.de/rdf/node | https://zenodo.org/communities/nfdi4bioimage | http://semanticscience.org/resource/SIO_000088      | https://doi.org/10.5281/zenodo.16812312      |
| https://nfdi4bioimage.de/rdf/node | https://zenodo.org/communities/nfdi4bioimage | http://semanticscience.org/resource/SIO_000088      | https://doi.org/10.5281/zenodo.16793739      |
| https://nfdi4bioimage.de/rdf/node | https://zenodo.org/communities/nfdi4bioimage | http://semanticscience.org/resource/SIO_000088      | https://doi.org/10.5281/zenodo.16736342      |
| https://nfdi4bioimage.de/rdf/node | https://zenodo.org/communities/nfdi4bioimage | http://semanticscience.org/resource/SIO_000088      | https://doi.org/10.5281/zenodo.16736220      |
| https://nfdi4bioimage.de/rdf/node | https://zenodo.org/communities/nfdi4bioimage | http://semanticscience.org/resource/SIO_000088      | https://doi.org/10.5281/zenodo.16735994      |
| https://nfdi4bioimage.de/rdf/node | https://zenodo.org/communities/nfdi4bioimage | http://semanticscience.org/resource/SIO_000088      | https://doi.org/10.5281/zenodo.16735893      |
| https://nfdi4bioimage.de/rdf/node | https://zenodo.org/communities/nfdi4bioimage | http://semanticscience.org/resource/SIO_000088      | https://doi.org/10.5281/zenodo.16735885      |
| https://nfdi4bioimage.de/rdf/node | https://zenodo.org/communities/nfdi4bioimage | http://semanticscience.org/resource/SIO_000088      | https://doi.org/10.5281/zenodo.16561545      |
| https://nfdi4bioimage.de/rdf/node | https://zenodo.org/communities/nfdi4bioimage | http://semanticscience.org/resource/SIO_000088      | https://doi.org/10.5281/zenodo.16561338      |
| https://nfdi4bioimage.de/rdf/node | https://zenodo.org/communities/nfdi4bioimage | http://semanticscience.org/resource/SIO_000088      | https://doi.org/10.5281/zenodo.16412004      |
| https://nfdi4bioimage.de/rdf/node | https://zenodo.org/communities/nfdi4bioimage | http://semanticscience.org/resource/SIO_000088      | https://doi.org/10.5281/zenodo.15858127      |
| https://nfdi4bioimage.de/rdf/node | https://zenodo.org/communities/nfdi4bioimage | http://semanticscience.org/resource/SIO_000088      | https://doi.org/10.5281/zenodo.15796252      |
| https://nfdi4bioimage.de/rdf/node | https://zenodo.org/communities/nfdi4bioimage | http://semanticscience.org/resource/SIO_000088      | https://doi.org/10.5281/zenodo.15793536      |
| https://nfdi4bioimage.de/rdf/node | https://zenodo.org/communities/nfdi4bioimage | http://semanticscience.org/resource/SIO_000088      | https://doi.org/10.5281/zenodo.15771899      |
| https://nfdi4bioimage.de/rdf/node | https://zenodo.org/communities/nfdi4bioimage | http://semanticscience.org/resource/SIO_000088      | https://doi.org/10.5281/zenodo.15756866      |
| https://nfdi4bioimage.de/rdf/node | https://zenodo.org/communities/nfdi4bioimage | http://semanticscience.org/resource/SIO_000088      | https://doi.org/10.5281/zenodo.15751975      |
| https://nfdi4bioimage.de/rdf/node | https://zenodo.org/communities/nfdi4bioimage | http://semanticscience.org/resource/SIO_000088      | https://doi.org/10.5281/zenodo.15750255      |
| https://nfdi4bioimage.de/rdf/node | https://zenodo.org/communities/nfdi4bioimage | http://semanticscience.org/resource/SIO_000088      | https://doi.org/10.5281/zenodo.15735577      |
| https://nfdi4bioimage.de/rdf/node | https://zenodo.org/communities/nfdi4bioimage | http://semanticscience.org/resource/SIO_000088      | https://doi.org/10.5281/zenodo.15698366      |
| https://nfdi4bioimage.de/rdf/node | https://zenodo.org/communities/nfdi4bioimage | http://semanticscience.org/resource/SIO_000088      | https://doi.org/10.5281/zenodo.15606013      |
| https://nfdi4bioimage.de/rdf/node | https://zenodo.org/communities/nfdi4bioimage | http://semanticscience.org/resource/SIO_000088      | https://doi.org/10.5281/zenodo.15597856      |
| https://nfdi4bioimage.de/rdf/node | https://zenodo.org/communities/nfdi4bioimage | http://semanticscience.org/resource/SIO_000088      | https://doi.org/10.5281/zenodo.15575379      |
| https://nfdi4bioimage.de/rdf/node | https://zenodo.org/communities/nfdi4bioimage | http://semanticscience.org/resource/SIO_000088      | https://doi.org/10.5281/zenodo.15546497      |
| https://nfdi4bioimage.de/rdf/node | https://zenodo.org/communities/nfdi4bioimage | http://semanticscience.org/resource/SIO_000088      | https://doi.org/10.5281/zenodo.15481680      |
| https://nfdi4bioimage.de/rdf/node | https://zenodo.org/communities/nfdi4bioimage | http://semanticscience.org/resource/SIO_000088      | https://doi.org/10.5281/zenodo.15479606      |
| https://nfdi4bioimage.de/rdf/node | https://zenodo.org/communities/nfdi4bioimage | http://semanticscience.org/resource/SIO_000088      | https://doi.org/10.5281/zenodo.15469809      |
| https://nfdi4bioimage.de/rdf/node | https://zenodo.org/communities/nfdi4bioimage | http://semanticscience.org/resource/SIO_000088      | https://doi.org/10.5281/zenodo.15424704      |
| https://nfdi4bioimage.de/rdf/node | https://zenodo.org/communities/nfdi4bioimage | http://semanticscience.org/resource/SIO_000088      | https://doi.org/10.5281/zenodo.15393592      |
| https://nfdi4bioimage.de/rdf/node | https://zenodo.org/communities/nfdi4bioimage | http://semanticscience.org/resource/SIO_000088      | https://doi.org/10.5281/zenodo.15379632      |
| https://nfdi4bioimage.de/rdf/node | https://zenodo.org/communities/nfdi4bioimage | http://semanticscience.org/resource/SIO_000088      | https://doi.org/10.5281/zenodo.15367563      |
| https://nfdi4bioimage.de/rdf/node | https://zenodo.org/communities/nfdi4bioimage | http://semanticscience.org/resource/SIO_000088      | https://doi.org/10.5281/zenodo.15319829      |
| https://nfdi4bioimage.de/rdf/node | https://zenodo.org/communities/nfdi4bioimage | http://semanticscience.org/resource/SIO_000088      | https://doi.org/10.5281/zenodo.15279551      |
| https://nfdi4bioimage.de/rdf/node | https://zenodo.org/communities/nfdi4bioimage | http://semanticscience.org/resource/SIO_000088      | https://doi.org/10.5281/zenodo.15267559      |
| https://nfdi4bioimage.de/rdf/node | https://zenodo.org/communities/nfdi4bioimage | http://semanticscience.org/resource/SIO_000088      | https://doi.org/10.5281/zenodo.15223802      |
| https://nfdi4bioimage.de/rdf/node | https://zenodo.org/communities/nfdi4bioimage | http://semanticscience.org/resource/SIO_000088      | https://doi.org/10.5281/zenodo.15193418      |
| https://nfdi4bioimage.de/rdf/node | https://zenodo.org/communities/nfdi4bioimage | http://semanticscience.org/resource/SIO_000088      | https://doi.org/10.5281/zenodo.15182563      |
| https://nfdi4bioimage.de/rdf/node | https://zenodo.org/communities/nfdi4bioimage | http://semanticscience.org/resource/SIO_000088      | https://doi.org/10.5281/zenodo.15165424      |
| https://nfdi4bioimage.de/rdf/node | https://zenodo.org/communities/nfdi4bioimage | http://semanticscience.org/resource/SIO_000088      | https://doi.org/10.5281/zenodo.14848838      |
| https://nfdi4bioimage.de/rdf/node | https://zenodo.org/communities/nfdi4bioimage | http://semanticscience.org/resource/SIO_000088      | https://doi.org/10.5281/zenodo.14001044      |
| https://nfdi4bioimage.de/rdf/node | https://zenodo.org/communities/nfdi4bioimage | http://semanticscience.org/resource/SIO_000088      | https://doi.org/10.5281/zenodo.10816895      |
| https://nfdi4bioimage.de/rdf/node | https://zenodo.org/communities/nfdi4bioimage | http://semanticscience.org/resource/SIO_000088      | https://doi.org/10.5281/zenodo.17404133      |
| https://nfdi4bioimage.de/rdf/node | https://zenodo.org/communities/nfdi4bioimage | http://semanticscience.org/resource/SIO_000088      | https://doi.org/10.5281/zenodo.17372593      |
| https://nfdi4bioimage.de/rdf/node | https://zenodo.org/communities/nfdi4bioimage | http://semanticscience.org/resource/SIO_000088      | https://doi.org/10.5281/zenodo.17191504      |
| https://nfdi4bioimage.de/rdf/node | https://zenodo.org/communities/nfdi4bioimage | http://semanticscience.org/resource/SIO_000088      | https://doi.org/10.5281/zenodo.10203284      |
| https://nfdi4bioimage.de/rdf/node | https://zenodo.org/communities/nfdi4bioimage | http://semanticscience.org/resource/SIO_000088      | https://doi.org/10.5281/zenodo.14264509      |
| https://nfdi4bioimage.de/rdf/node | https://zenodo.org/communities/nfdi4bioimage | http://semanticscience.org/resource/SIO_000088      | https://doi.org/10.5281/zenodo.14264885      |
| https://nfdi4bioimage.de/rdf/node | https://zenodo.org/communities/nfdi4bioimage | http://semanticscience.org/resource/SIO_000088      | https://doi.org/10.5281/zenodo.14710820      |
| https://nfdi4bioimage.de/rdf/node | https://zenodo.org/communities/nfdi4bioimage | http://semanticscience.org/resource/SIO_000088      | https://doi.org/10.5281/zenodo.17424911      |
| https://nfdi4bioimage.de/rdf/node | https://zenodo.org/communities/nfdi4bioimage | http://semanticscience.org/resource/SIO_000088      | https://doi.org/10.5281/zenodo.17429285      |
| https://nfdi4bioimage.de/rdf/node | https://zenodo.org/communities/nfdi4bioimage | http://semanticscience.org/resource/SIO_000088      | https://doi.org/10.5281/zenodo.17472821      |
| https://nfdi4bioimage.de/rdf/node | https://zenodo.org/communities/nfdi4bioimage | http://semanticscience.org/resource/SIO_000088      | https://doi.org/10.5281/zenodo.17476640      |
| https://nfdi4bioimage.de/rdf/node | https://zenodo.org/communities/nfdi4bioimage | http://semanticscience.org/resource/SIO_000088      | https://doi.org/10.5281/zenodo.17477053      |
| https://nfdi4bioimage.de/rdf/node | https://zenodo.org/communities/nfdi4bioimage | http://semanticscience.org/resource/SIO_000088      | https://doi.org/10.5281/zenodo.17487264      |
| https://nfdi4bioimage.de/rdf/node | https://zenodo.org/communities/nfdi4bioimage | http://semanticscience.org/resource/SIO_000088      | https://doi.org/10.5281/zenodo.17541532      |
| https://nfdi4bioimage.de/rdf/node | https://zenodo.org/communities/nfdi4bioimage | http://semanticscience.org/resource/SIO_000088      | https://doi.org/10.5281/zenodo.17564219      |
| https://nfdi4bioimage.de/rdf/node | https://zenodo.org/communities/nfdi4bioimage | http://semanticscience.org/resource/SIO_000088      | https://doi.org/10.5281/zenodo.17579804      |
| https://nfdi4bioimage.de/rdf/node | https://zenodo.org/communities/nfdi4bioimage | http://semanticscience.org/resource/SIO_000088      | https://doi.org/10.5281/zenodo.17604591      |
| https://nfdi4bioimage.de/rdf/node | https://zenodo.org/communities/nfdi4bioimage | http://semanticscience.org/resource/SIO_000088      | https://doi.org/10.5281/zenodo.17607828      |
| https://nfdi4bioimage.de/rdf/node | https://zenodo.org/communities/nfdi4bioimage | http://semanticscience.org/resource/SIO_000088      | https://doi.org/10.5281/zenodo.17639350      |
| https://nfdi4bioimage.de/rdf/node | https://zenodo.org/communities/nfdi4bioimage | http://semanticscience.org/resource/SIO_000088      | https://doi.org/10.5281/zenodo.17659149      |
| https://nfdi4bioimage.de/rdf/node | https://zenodo.org/communities/nfdi4bioimage | http://semanticscience.org/resource/SIO_000088      | https://doi.org/10.5281/zenodo.17669681      |
| https://nfdi4bioimage.de/rdf/node | https://zenodo.org/communities/nfdi4bioimage | http://semanticscience.org/resource/SIO_000088      | https://doi.org/10.5281/zenodo.17671971      |
| https://nfdi4bioimage.de/rdf/node | https://zenodo.org/communities/nfdi4bioimage | http://semanticscience.org/resource/SIO_000088      | https://doi.org/10.5281/zenodo.17775761      |
| https://nfdi4bioimage.de/rdf/node | https://zenodo.org/communities/nfdi4bioimage | http://semanticscience.org/resource/SIO_000088      | https://doi.org/10.5281/zenodo.17775957      |
| https://nfdi4bioimage.de/rdf/node | https://zenodo.org/communities/nfdi4bioimage | http://semanticscience.org/resource/SIO_000088      | https://doi.org/10.5281/zenodo.17787401      |
| https://nfdi4bioimage.de/rdf/node | https://zenodo.org/communities/nfdi4bioimage | http://semanticscience.org/resource/SIO_000088      | https://doi.org/10.5281/zenodo.17856704      |
| https://nfdi4bioimage.de/rdf/node | https://zenodo.org/communities/nfdi4bioimage | http://semanticscience.org/resource/SIO_000088      | https://doi.org/10.5281/zenodo.17876813      |
| https://nfdi4bioimage.de/rdf/node | https://zenodo.org/communities/nfdi4bioimage | http://semanticscience.org/resource/SIO_000088      | https://doi.org/10.5281/zenodo.17897525      |
| https://nfdi4bioimage.de/rdf/node | https://zenodo.org/communities/nfdi4bioimage | http://semanticscience.org/resource/SIO_000088      | https://doi.org/10.5281/zenodo.17898202      |
| https://nfdi4bioimage.de/rdf/node | https://zenodo.org/communities/nfdi4bioimage | http://semanticscience.org/resource/SIO_000088      | https://doi.org/10.5281/zenodo.17974214      |
| https://nfdi4bioimage.de/rdf/node | https://zenodo.org/communities/nfdi4bioimage | http://semanticscience.org/resource/SIO_000088      | https://doi.org/10.5281/zenodo.17977384      |
| https://nfdi4bioimage.de/rdf/node | https://zenodo.org/communities/nfdi4bioimage | http://semanticscience.org/resource/SIO_000088      | https://doi.org/10.5281/zenodo.17978132      |
| https://nfdi4bioimage.de/rdf/node | https://zenodo.org/communities/nfdi4bioimage | http://semanticscience.org/resource/SIO_000088      | https://doi.org/10.5281/zenodo.18184329      |
| https://nfdi4bioimage.de/rdf/node | https://zenodo.org/communities/nfdi4bioimage | http://semanticscience.org/resource/SIO_000088      | https://doi.org/10.5281/zenodo.18230666      |
| https://nfdi4bioimage.de/rdf/node | https://zenodo.org/communities/nfdi4bioimage | http://semanticscience.org/resource/SIO_000088      | https://doi.org/10.5281/zenodo.18415225      |
| https://nfdi4bioimage.de/rdf/node | https://zenodo.org/communities/nfdi4bioimage | http://semanticscience.org/resource/SIO_000088      | https://doi.org/10.5281/zenodo.18454238      |
| https://nfdi4bioimage.de/rdf/node | https://zenodo.org/communities/nfdi4bioimage | http://semanticscience.org/resource/SIO_000088      | https://doi.org/10.5281/zenodo.18659976      |
| https://nfdi4bioimage.de/rdf/node | https://zenodo.org/communities/nfdi4bioimage | http://semanticscience.org/resource/SIO_000088      | https://doi.org/10.5281/zenodo.18694155      |
| https://nfdi4bioimage.de/rdf/node | https://zenodo.org/communities/nfdi4bioimage | http://semanticscience.org/resource/SIO_000088      | https://doi.org/10.5281/zenodo.18712011      |
| https://nfdi4bioimage.de/rdf/node | https://zenodo.org/communities/nfdi4bioimage | http://semanticscience.org/resource/SIO_000088      | https://doi.org/10.5281/zenodo.18735653      |
| https://nfdi4bioimage.de/rdf/node | https://zenodo.org/communities/nfdi4bioimage | http://semanticscience.org/resource/SIO_000088      | https://doi.org/10.5281/zenodo.18754248      |
| https://nfdi4bioimage.de/rdf/node | https://zenodo.org/communities/nfdi4bioimage | http://semanticscience.org/resource/SIO_000088      | https://doi.org/10.5281/zenodo.18782352      |
| https://nfdi4bioimage.de/rdf/node | https://zenodo.org/communities/nfdi4bioimage | http://semanticscience.org/resource/SIO_000088      | https://doi.org/10.5281/zenodo.18953151      |
| https://nfdi4bioimage.de/rdf/node | https://zenodo.org/communities/nfdi4bioimage | http://semanticscience.org/resource/SIO_000088      | https://doi.org/10.5281/zenodo.18957947      |
| https://nfdi4bioimage.de/rdf/node | https://zenodo.org/communities/nfdi4bioimage | http://semanticscience.org/resource/SIO_000088      | https://doi.org/10.5281/zenodo.18984621      |
| https://nfdi4bioimage.de/rdf/node | https://zenodo.org/communities/nfdi4bioimage | http://semanticscience.org/resource/SIO_000088      | https://doi.org/10.5281/zenodo.18998676      |
| https://nfdi4bioimage.de/rdf/node | https://zenodo.org/communities/nfdi4bioimage | http://semanticscience.org/resource/SIO_000088      | https://doi.org/10.5281/zenodo.19001717      |
| https://nfdi4bioimage.de/rdf/node | https://zenodo.org/communities/nfdi4bioimage | http://semanticscience.org/resource/SIO_000088      | https://doi.org/10.5281/zenodo.19046270      |
| https://nfdi4bioimage.de/rdf/node | https://zenodo.org/communities/nfdi4bioimage | http://semanticscience.org/resource/SIO_000088      | https://doi.org/10.5281/zenodo.19063027      |
| https://nfdi4bioimage.de/rdf/node | https://zenodo.org/communities/nfdi4bioimage | http://semanticscience.org/resource/SIO_000088      | https://doi.org/10.5281/zenodo.19107804      |
| https://nfdi4bioimage.de/rdf/node | https://zenodo.org/communities/nfdi4bioimage | http://semanticscience.org/resource/SIO_000088      | https://doi.org/10.5281/zenodo.19177652      |
| https://nfdi4bioimage.de/rdf/node | https://zenodo.org/communities/nfdi4bioimage | http://semanticscience.org/resource/SIO_000088      | https://doi.org/10.5281/zenodo.19184109      |
| https://nfdi4bioimage.de/rdf/node | https://zenodo.org/communities/nfdi4bioimage | http://semanticscience.org/resource/SIO_000088      | https://doi.org/10.5281/zenodo.19239481      |
| https://nfdi4bioimage.de/rdf/node | https://zenodo.org/communities/nfdi4bioimage | http://semanticscience.org/resource/SIO_000088      | https://doi.org/10.5281/zenodo.19246441      |
| https://nfdi4bioimage.de/rdf/node | https://zenodo.org/communities/nfdi4bioimage | http://semanticscience.org/resource/SIO_000088      | https://doi.org/10.5281/zenodo.19335305      |
| https://nfdi4bioimage.de/rdf/node | https://zenodo.org/communities/nfdi4bioimage | http://semanticscience.org/resource/SIO_000088      | https://doi.org/10.5281/zenodo.19352622      |
| https://nfdi4bioimage.de/rdf/node | https://zenodo.org/communities/nfdi4bioimage | http://semanticscience.org/resource/SIO_000088      | https://doi.org/10.5281/zenodo.19366801      |
| https://nfdi4bioimage.de/rdf/node | https://zenodo.org/communities/nfdi4bioimage | http://semanticscience.org/resource/SIO_000088      | https://doi.org/10.5281/zenodo.19450032      |
| https://nfdi4bioimage.de/rdf/node | https://zenodo.org/communities/nfdi4bioimage | http://semanticscience.org/resource/SIO_000088      | https://doi.org/10.5281/zenodo.19469051      |
| https://nfdi4bioimage.de/rdf/node | https://zenodo.org/communities/nfdi4bioimage | http://semanticscience.org/resource/SIO_000088      | https://doi.org/10.5281/zenodo.19627003      |
| https://nfdi4bioimage.de/rdf/node | https://zenodo.org/communities/nfdi4bioimage | http://semanticscience.org/resource/SIO_000088      | https://doi.org/10.5281/zenodo.19949157      |
| https://nfdi4bioimage.de/rdf/node | https://zenodo.org/communities/nfdi4bioimage | http://semanticscience.org/resource/SIO_000088      | https://doi.org/10.5281/zenodo.20024684      |
| https://nfdi4bioimage.de/rdf/node | https://zenodo.org/communities/nfdi4bioimage | http://semanticscience.org/resource/SIO_000088      | https://doi.org/10.5281/zenodo.20039402      |
| https://nfdi4bioimage.de/rdf/node | https://zenodo.org/communities/nfdi4bioimage | http://semanticscience.org/resource/SIO_000088      | https://doi.org/10.5281/zenodo.20271104      |
| https://nfdi4bioimage.de/rdf/node | https://zenodo.org/communities/nfdi4bioimage | http://semanticscience.org/resource/SIO_000088      | https://doi.org/10.5281/zenodo.20275730      |
| https://nfdi4bioimage.de/rdf/node | https://zenodo.org/communities/nfdi4bioimage | http://semanticscience.org/resource/SIO_000088      | https://doi.org/10.5281/zenodo.20282961      |
| https://nfdi4bioimage.de/rdf/node | https://zenodo.org/communities/nfdi4bioimage | http://semanticscience.org/resource/SIO_000088      | https://doi.org/10.5281/zenodo.20509378      |
| https://nfdi4bioimage.de/rdf/node | https://zenodo.org/communities/nfdi4bioimage | http://semanticscience.org/resource/SIO_000088      | https://doi.org/10.5281/zenodo.20512957      |
| https://nfdi4bioimage.de/rdf/node | https://zenodo.org/communities/nfdi4bioimage | https://www.w3.org/TR/prov-o/#wasAttributedTo       | https://nfdi4bioimage.de/rdf/node            |

**** DONE NFDI_001008 (op)
CLOSED: [2026-06-05 Fri 11:42]
:PROPERTIES:
:ID:       57dd40fa-d7d0-4edf-89eb-8e237441daa7
:END:
- affected graph: n4bi_zenodo_community
- affected terms


#+begin_src sparql
  <<prefixes>>
  select * where {
    {
    graph n4bikg:n4bi_zenodo_community {?s nfdicore:NFDI_0001008 ?o}
      }
    union {
      graph n4bikg:owl { nfdicore:NFDI_0001008 rdfs:label ?label }
      }
   }
#+end_src

#+RESULTS:
| s                                            | o                                            | label   |
|----------------------------------------------+----------------------------------------------+---------|
| https://zenodo.org/communities/nfdi4bioimage | https://zenodo.org/communities/nfdi4bioimage |         |
|                                              |                                              | has url |

will replace by (zenodo_communit provo:wasAttributedTo n4bi)

***** sparql update
:PROPERTIES:
:ID:       e37f7a12-6c74-4903-a596-979b2bb80206
:END:
#+begin_src sparql :eval no
  <<prefixes>>
  prefix prov <https://www.w3.org/TR/prov-o/#>

  delete {
    graph n4bikg:n4bi_zenodo_community {?s nfdicore:NFDI_0001008 ?o}
    }
  insert {
    graph n4bikg:n4bi_zenodo_community {?s schema:url ?s .}
    }
  where {
    graph n4bikg:n4bi_zenodo_community {?s nfdicore:NFDI_0001008 ?o}
    }
#+end_src

***** check
:PROPERTIES:
:ID:       24492f6d-fe6f-4eb5-aee0-0f0b0dc413fe
:END:
#+begin_src sparql
  <<prefixes>>
  select * where {
    optional
    {
    graph n4bikg:n4bi_zenodo_community {?s nfdicore:NFDI_0001080 ?o}
    }
    optional {
    graph n4bikg:n4bi_zenodo_community {?s schema:url ?o .}
    }
    }
#+end_src

#+RESULTS:
| s                                            | o                                            |
|----------------------------------------------+----------------------------------------------|
| https://zenodo.org/communities/nfdi4bioimage | https://zenodo.org/communities/nfdi4bioimage |

*** Update nfdicore ontology
:PROPERTIES:
:ID:       ffb0e1ea-7cdb-47d1-a723-776e2810140a
:END:
#+begin_src bash
  wget -O RDF_dumps/nfdicore-3.0.5.ttl https://ise-fizkarlsruhe.github.io/nfdicore/ontology.ttl 
  wget -O RDF_dumps/
#+end_src

#+RESULTS:

* Varia
:PROPERTIES:
:ID:       e1ae9ca6-a77d-4c02-b87a-70f15f3a428f
:END:
** Dump entire graph and feed to gephi
:PROPERTIES:
:ID:       b3524e57-8d3c-4732-b6f5-35cf58e06867
:END:

#+begin_src sparql :url https://kg.nfdi4bioimage.de/N4BIKG/sparql :results output file link
  construct {?s ?p ?o} where {graph ?g {?s ?p ?o}}
#+end_src

#+RESULTS:
[[file:HTTP/1.1 400 Bad Request
Alt-Svc: h3=":443"; ma=2592000
Cache-Control: must-revalidate,no-cache,no-store
Content-Length: 63
Content-Type: text/plain;charset=utf-8
Date: Fri, 17 Oct 2025 13:53:40 GMT
Fuseki-Request-Id: 34
Pragma: no-cache
Vary: Origin
Via: 1.1 Caddy

Parse error: Encountered " <VAR1> "?o "" at line 1, column 21.
]]
PREFIX adms:         <http://www.w3.org/ns/adms#>
PREFIX bibo:         <http://purl.org/ontology/bibo/>
PREFIX core:         <https://ld.openmicroscopy.org/core/>
PREFIX datacite:     <https://schema.datacite.org/meta/kernel-4.6/metadata.xsd#>
PREFIX dc:           <http://purl.org/dc/elements/1.1/>
PREFIX dcite:        <https://schema.datacite.org/meta/kernel-4.6/metadata.xsd#>
PREFIX dcterms:      <http://purl.org/dc/terms/>
PREFIX doap:         <http://usefulinc.com/ns/doap#>
PREFIX edam:         <http://purl.obolibrary.org/obo/edam#>
PREFIX edamontology: <http://edamontology.org/>
PREFIX foaf:         <http://xmlns.com/foaf/0.1/>
PREFIX linkml:       <https://w3id.org/linkml/>
PREFIX ncit:         <http://purl.obolibrary.org/obo/NCIT_>
PREFIX nfdicore:     <https://nfdi.fiz-karlsruhe.de/ontology/>
PREFIX obo:          <http://purl.obolibrary.org/obo/>
PREFIX oboInOwl:     <http://www.geneontology.org/formats/oboInOwl#>
PREFIX ontology:     <https://nfdi.fiz-karlsruhe.de/ontology/>
PREFIX orcid:        <https://orcid.org/>
PREFIX owl:          <http://www.w3.org/2002/07/owl#>
PREFIX rdf:          <http://www.w3.org/1999/02/22-rdf-syntax-ns#>
PREFIX rdfs:         <http://www.w3.org/2000/01/rdf-schema#>
PREFIX ror:          <https://ror.org/>
PREFIX sio:          <http://semanticscience.org/resource/>
PREFIX skos:         <http://www.w3.org/2004/02/skos/core#>
PREFIX t4fs:         <http://purl.obolibrary.org/obo/T4FS_>
PREFIX terms:        <http://purl.org/dc/terms/>
PREFIX vann:         <http://purl.org/vocab/vann/>
PREFIX wd:           <http://www.wikidata.org/entity/>
PREFIX wdt:          <http://www.wikidata.org/prop/direct/>
PREFIX xml:          <http://www.w3.org/XML/1998/namespace>
PREFIX xo:           <http://rhizomik.net/redefer/xsl/xsd2owl-functions.xsl>
PREFIX xs:           <http://www.w3.org/2001/XMLSchema#>
PREFIX xsd:          <http://www.w3.org/2001/XMLSchema#>
PREFIX xsi:          <http://www.w3.org/2001/XMLSchema-instance#>
PREFIX zenodo:       <https://zenodo.org/ns/>
]]
* Archiving
:PROPERTIES:
:ID:       074c9b38-5850-42fc-a75a-69e34d489883
:END:
After each update operation, all graphs should be dumped and git committed to serve as a starting point for the next round of updates.
** [2026-06-05 Fri]
:PROPERTIES:
:ID:       6cd8a80c-486e-4d02-9240-a444b630c7ca
:header-args:sparql: :url http://kg.nfdi4bioimage.de/N4BIKG/sparql
:END:
*** core
:PROPERTIES:
:ID:       ea6af02c-37f6-458c-b65f-24b541074ee0
:END:
#+begin_src sparql :results output file :file Archive/core--20260605.n3 :var graph="<https://kg.nfdi4bioimage.de/n4bikg/core>"
  construct {?s ?p ?o} where {
    graph $graph {?s ?p ?o}
    }
#+end_src

#+RESULTS:
[[file:Archive/core--20260605.n3]]
*** services
:PROPERTIES:
:ID:       d554b550-5d7e-4ce1-923a-dbbee28a54ac
:END:
#+begin_src sparql :results output file :file Archive/services--20260605.n3 :var graph="<https://kg.nfdi4bioimage.de/n4bikg/services>"
  construct {?s ?p ?o} where {
    graph $graph {?s ?p ?o}
    }
#+end_src

#+RESULTS:
[[file:Archive/services--20260605.n3]]
*** n4bi_zenodo_community
:PROPERTIES:
:ID:       020393fb-e7fe-4a8d-bc51-d8d60743174e
:END:
#+begin_src sparql :results output file :file Archive/n4bi_zenodo_community--20260605.n3 :var graph="<https://kg.nfdi4bioimage.de/n4bikg/n4bi_zenodo_community>"
  construct {?s ?p ?o} where {
    graph $graph {?s ?p ?o}
    }
#+end_src

#+RESULTS:
[[file:Archive/n4bi_zenodo_community--20260605.n3]]
*** owl
:PROPERTIES:
:ID:       645eacc4-3744-4596-8eb6-9e374966ba66
:END:
#+begin_src sparql :results output file :file Archive/owl--20260605.n3 :var graph="<https://kg.nfdi4bioimage.de/n4bikg/owl>"
  construct {?s ?p ?o} where {
    graph $graph {?s ?p ?o}
    }
#+end_src

#+RESULTS:
[[file:Archive/owl--20260605.n3]]
*** git
:PROPERTIES:
:ID:       b678e448-d2b1-4583-879d-cc5208809ee6
:END:
#+begin_src bash
  git add Archive/*.n3
  git commit -m "Archiving graphs."
#+end_src

